[{"Q": "For student reception days?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "On which days can students come for a reception?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "When are students allowed to come for a reception?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "For what occasions can students come?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "What days are reserved for student receptions?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "When do student receptions take place?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "At what time can students be received?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "Which days are open for student visits?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "When can students make a visit?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "When are students welcomed for a reception?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "Which days are designated for meeting students?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "Which days are scheduled for student receptions?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "At what times can students be received?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "When can students come for a reception?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "When are students welcomed for a visit?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "Which days are available for meeting students?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "Which days are students invited to come?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "For what occasions are students received?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "Which days are reception days open to students?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "When can students come for a visit?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "When are students allowed to come for a visit?", "A": "Sunday, Tuesday, and Thursday"},
{"Q": "For any mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "How can I get help for any mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Who should I contact in case of mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Where can I report mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "What is the procedure to resolve mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Who can I contact if I have difficulties with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "How to contact support for mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Where can I get help if I have issues with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "What is the communication channel to report mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Who should I address my questions regarding my mailbox (account, password) to?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "What is the way to ask for help for mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "How can I get help if I have problems with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Who should I contact in case of difficulties with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "What is the process to follow to resolve mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Where can I get assistance if I have issues with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Who to contact if I need help with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "What is the procedure for reporting mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Where can I find help if I have technical difficulties with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "What is the recommended communication method to resolve mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "Who can I contact if I have technical problems with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "How to ask for help in case of issues with my mailbox (account, password)?", "A": "Send a message to scolarite@estin.dz"},
{"Q": "For what cases can I request a duplicate of a document?", "A": "In case of loss or damage of a document. You need to present a legalized sworn statement at the town hall (Office #2 and Office #3)"},
{"Q": "For any talent or elearn problems?", "A": "Send a message to ing_ouaret@estin.dz and ing_guellal@estin.dz"},
{"Q": "I want to reach the deputy director for a personal issue?", "A": "Contact them via email first"},
{"Q": "Can I get a certified copy of my BAC transcript?", "A": "Yes, you need to submit a copy of the BAC transcript at the (Office #2), and come back after 4 days."},
{"Q": "Can I get a certified copy immediately?", "A": "No, there's a verification procedure. It takes time."},
{"Q": "Can I permanently withdraw the original BAC document?", "A": "Yes, you must fill out the sworn statement and have it approved by the town hall + clearance + discharge (Office #2 and Office #3)"},
{"Q": "Can I request certificates for language, conduct, and ranking?", "A": "Contact ade@estin.dz"},
{"Q": "How to contact one of my course or TD teachers?", "A": "Contact them via email at https://estin.dz/annuaire-des-enseignants/"},
{"Q": "How to contact the director of ESTIN?", "A": "Contact their assistant via email to schedule an appointment adg@estin.dz"},
{"Q": "For anything regarding student scholarships and accommodation?", "A": "Contact the DOUB of Elkseur (http://doub-elkseur.dz/), (located at Berchiche 3 residence) and Amizour 2 residence"},
{"Q": "For health problems?", "A": "Approach the ESTIN medical center or contact the doctor via email medecin@estin.dz"},
{"Q": "For medical justifications?", "A": "Approach the secretariat of the CP and CS departments or send them by email (Office #4)"},
{"Q": "How to apply for academic leave?", "A": "Submit a dossier before exams for consideration (Office #2 and Office #3)"},
{"Q": "For anything regarding teacher substitutes (Documents to be submitted, individual schedules)?", "A": "Approach the secretariat of the CP and CS departments (Office #4)"},
{"Q": "Obtain the ATS and Teacher function certificates?", "A": "Contact the personnel service sdpersonnel@estin.dz"},
{"Q": "Obtain lists of groups, markers, brushes?", "A": "Approach the secretariat of the CP and CS departments (Office #4)"},
{"Q": "Fill out a deficiency report (collective absence of students)?", "A": "Approach the secretariat of the CP and CS departments (Office #4)"},
{"Q": "For documentation?", "A": "Approach the school library bibliothèque@estin.dz"},
{"Q": "Regarding the LMD doctorate?", "A": "Approach the secretariat of the deputy director in charge of doctoral training, scientific research, technological development, innovation, and entrepreneurship promotion. (Office #12)"},
{"Q": "Regarding external relations?", "A": "Approach the secretariat of the deputy director in charge of information systems and communication and external relations. (Office #12)"},
{"Q": "Regarding school clubs?", "A": "Contact the cultural activities service: activites_culturelles@estin.dz"},
{"Q": "Regarding security?", "A": "Contact Mr. AOUGHLIS Nabil: surete@estin.dz"},
{"Q": "ESTIN address?", "A": "MW77+F23, N75, Amizour. GPS: https://maps.app.goo.gl/1YuyXPKLZEhNxt4f7"},
{"Q": "Email of AGGAOUA Meriem", "A": "Contact at: aggaoua@estin.dz"},
{"Q": "Email of AIT TALEB Samiha", "A": "Contact at: aittaleb@estin.dz"},
{"Q": "Email of ALKAMA Lynda", "A": "Contact at: Alkama@estin.dz"},
{"Q": "Email of AZOUAOU Faical", "A": "Contact at: azouaou@estin.dz"},
{"Q": "Email of AZZOUGUER Dalila", "A": "daliladali2403@gmail.com"},
{"Q": "Email of ELMIR Youssef", "A": "elmire@estin.dz"},
{"Q": "Email of BENMERRAD Saliha", "A": "benmerrad@estin.dz"},
{"Q": "Email of BENSLIMANE Salim", "A": "benslimane@estin.dz"},
{"Q": "Email of Berbague Chemseddine", "A": "berbague@estin.dz"},
{"Q": "Email of BOUCHOUCHA Lydia", "A": "bouchoucha@estin.dz"},
{"Q": "Email of BOUGLIMINA Ouahiba", "A": "bouglimina@estin.dz"},
{"Q": "Email of BOUKHAMA Macilia", "A": "boukhama@estin.dz"},
{"Q": "Email of Bousla Sidali", "A": "bousla@estin.dz"},
{"Q": "Email of BRAHIMI Yasmine", "A": "brahimi@estin.dz"},
{"Q": "Email of CHEKLAT Lamia", "A": "cheklat@estin.dz"},
{"Q": "Email of CHELOUAH Leila", "A": "chelouah@estin.dz"},
{"Q": "Email of Cherfaoui Saida", "A": "cherfaoui@estin.dz"},
{"Q": "Email of Daoudi Meroua", "A": "daoudi@estin.dz"},
{"Q": "Programs offered by ESTIN", "A": "Please visit https://estin.dz/programme-de-formation/ for information on the training program."},
{"Q": "I need information about this school", "A": "The School was established in 2019 under the name of the Higher School of Computer Science and Digital Technologies (ESTIN). For more information: www.estin.dz"},
{"Q": "Email of Djabri Yousra", "A": "Contact at: yousra_djabri@yahoo.com"},
{"Q": "Email of Djenadi Ali", "A": "Contact at: djenadi@estin.dz"},
{"Q": "Email of HAMAMOUCHE Assia", "A": "Contact at: hammamouche@estin.dz"},
{"Q": "Email of HAMMADOUCHE Taklit", "A": "Contact at: hammadouche@estin.dz"},
{"Q": "Email of KHENNOUCHE Feriel", "A": "Contact at: khennouche@estin.dz"},
{"Q": "Where is ESTIN located?", "A": "Campus Amizour, Béjaia"},
{"Q": "What is the location of ESTIN?", "A": "Campus Amizour, Béjaia"},
{"Q": "What are the geographical coordinates of ESTIN?", "A": "N36°39’54” E4°54’36”"}, 
{"Q": "What is the total surface area of ESTIN?", "A": "08 hectares"},
{"Q": "How large is the ESTIN campus?", "A": "08 hectares"},
{"Q": "What is the constructible area of ESTIN?", "A": "50,000 m²"},
{"Q": "Who is the director of ESTIN?", "A": "The Director of ESTIN, assisted by deputy directors, the Secretary General, and the Director of the Library"},
{"Q": "Who manages ESTIN?", "A": "The Director of ESTIN, with assistance from deputy directors and other officials"},
{"Q": "What are the main administrative bodies of ESTIN?", "A": "ESTIN is administered by a Board of Directors and a Scientific Council"},
{"Q": "How is ESTIN managed?", "A": "By a Director, a Board of Directors, and a Scientific Council"},
{"Q": "What are the responsibilities of the Deputy Director of Education?", "A": "Supervises services related to education, diplomas, and continuous training"},
{"Q": "What does the Deputy Director of Education do?", "A": "Oversees services for teaching, evaluation, internships, diplomas, and continuous education"},
{"Q": "What is the role of the Deputy Director for Scientific Research?", "A": "Manages doctoral studies, research, and promotes innovation and entrepreneurship"},
{"Q": "Who is responsible for doctoral research at ESTIN?", "A": "The Deputy Director for Scientific Research and Technological Development"}, 
{"Q": "What does the Deputy Director of Information Systems do?", "A": "Oversees information systems, communication, and external relations"},
{"Q": "Who handles external relations at ESTIN?", "A": "The Deputy Director of Information Systems and External Relations"}, 
{"Q": "Who assists the Secretary General at ESTIN?", "A": "The sub-director of personnel, training, and cultural and sports activities; and the sub-director of finance and logistics"},
{"Q": "What are the responsibilities of the Secretary General?", "A": "Manages personnel, training, cultural and sports activities, finances, and resources"},
{"Q": "Who manages the library at ESTIN?", "A": "The Director of the Library, assisted by the acquisition, bibliographic research, and reception services"},
{"Q": "What are the services offered by the library at ESTIN?", "A": "Acquisition and processing, bibliographic research, and student reception"}, 
{"Q": "Who assists the department heads at ESTIN?", "A": "The heads of first and second cycle training and heads of third cycle and research activities"},
{"Q": "Who assists the Director in managing ESTIN?", "A": "The Director is assisted by Deputy Directors, a Secretary General, and Department Heads."},
{"Q": "What are the main responsibilities of the Deputy Director of Education?", "A": "Managing teaching, diplomas, continuous training, and evaluation services."},
{"Q": "What services are under the Deputy Director of Scientific Research?", "A": "Doctoral training, research activities, innovation, and entrepreneurship promotion."},
{"Q": "Who is in charge of information systems at ESTIN?", "A": "The Deputy Director of Information Systems and External Relations."},
{"Q": "What services fall under the Director of the Library?", "A": "Acquisition and processing, bibliographic research, and student reception and orientation."},
{"Q": "What are the responsibilities of the Secretary General at ESTIN?", "A": "Overseeing personnel, finances, cultural activities, and internal security."},
{"Q": "Which department handles the maintenance and management of assets?", "A": "The Department of Maintenance and Asset Management under the Secretary General."},
{"Q": "What services are managed by the Department Heads?", "A": "They oversee first, second, and third cycle training as well as research activities."},
{"Q": "Who is responsible for handling finances and logistics at ESTIN?", "A": "The Deputy Director of Finance and Logistics under the Secretary General."},
{"Q": "What is the role of the Internal Security Office?", "A": "Ensuring the safety and security of the ESTIN campus and its activities."},
{"Q": "What is the admission criteria for ESTIN?", "A": "Admission is based on a weighted average of 15/20 or higher, with the average calculated based on baccalaureate scores."},
{"Q": "What are the previous admission averages for ESTIN?", "A": "For 2021/2022: Mathematics - 17.02, Experimental Sciences - 17.50, Technical Mathematics - 18.03."},
{"Q": "When are the open doors for ESTIN in 2022?", "A": "The open doors are from July 17 to July 20, 2022."},
{"Q": "How do I pre-register for ESTIN?", "A": "Pre-register online from July 21 to July 24, 2022, by filling in your choice form on https://www.orientation.esi.dz."},
{"Q": "What is the ESTIN code for pre-registration?", "A": "The ESTIN code is C00CAN03."},
{"Q": "What is the deadline for confirming pre-registration?", "A": "You must confirm your pre-registration by July 26, 2022."},
{"Q": "When will the pre-registration results be available?", "A": "The results will be announced on August 3, 2022, on the website https://www.orientation-esi.dz."},
{"Q": "What happens if a student is not assigned to any of their chosen fields?", "A": "If no choice is satisfied, the student can reapply for a new pre-registration from August 4 to August 6, 2022."},
{"Q": "When are the results of the second round of assignments?", "A": "The results will be available on August 11, 2022."},
{"Q": "When do final registrations take place at ESTIN?", "A": "Final registrations are from September 5 to September 8, 2022, through the PROGRES platform."},
{"Q": "What documents are required for final registration at ESTIN?", "A": "The original baccalaureate transcript, 2 ID photos, payment receipt of 200DA, and the assignment certificate."},
{"Q": "When does the university portal for student services open?", "A": "The portal opens from August 20 to August 26, 2022."},
{"Q": "How can I apply for a scholarship or accommodation at ESTIN?", "A": "You can submit your application on the university services portal from August 20 to August 26, 2022."},
{"Q": "When are special cases handled?", "A": "Special cases for students with foreign baccalaureates are handled from September 9 to September 15, 2022."},
{"Q": "What are the important links for pre-registration and orientation?", "A": "Important links include https://www.orientation-esi.dz, https://bac2022.mesrs.dz, and https://www.mesrs.dz."},
{"Q": "Who can request an academic leave during the 2023/2024 academic year?","A": "Students facing exceptional circumstances such as chronic illness, maternity, long-term illness, national service, or family obligations can request an academic leave."},
{"Q": "What are the reasons for which a student can apply for academic leave?","A": "The reasons include chronic illness, maternity, long-term illness, national service, and family obligations related to ascendants or descendants, or relocation of a spouse or parents due to their job."},
{"Q": "When can students submit an academic leave request?","A": "Students can submit their academic leave requests starting November 15, 2023, for the second session."},
{"Q": "What is the deadline to submit the academic leave request?","A": "The deadline for submitting the academic leave request is December 21, 2023."},
{"Q": "Where should students submit their academic leave requests?","A": "Students must submit their academic leave requests to the Pedagogy Department."},
{"Q": "What form do students need to submit for academic leave?","A": "Students must download and carefully fill out the Academic Leave Request Form, which specifies the required documents."},
{"Q": "What happens after submitting the academic leave request?","A": "A decision will be issued for each student whose request is accepted. The student must include this decision in their re-enrollment file when returning to studies."},
{"Q": "Where can students check the results of their academic leave requests?","A": "The results will be posted on the school's website: https://estin.dz/"},
{"Q": "What should students do if their academic leave is accepted?","A": "If the request is accepted, students must sign the Academic Leave Clearance form and retrieve the ‘Academic Leave Decision’ within 15 days of the results being posted."},
{"Q": "What happens if a student does not retrieve their Academic Leave Decision?","A": "Failure to retrieve the decision within the specified time will result in the cancellation of the academic leave."},
{"Q": "What is the procedure for returning to studies after an academic leave?","A": "Students must submit their re-enrollment request following the procedure outlined, including the required documents like the academic leave decision and a medical authorization if applicable."},
{"Q": "What documents are required to return after an academic leave?","A": "Students must provide a completed re-enrollment request form, a copy of the Academic Leave Decision, and for medical cases, an authorization to resume studies from their treating physician."},
{"Q": "What agreements has ESTIN signed?", "A": "ESTIN has signed several agreements with various organizations aimed at establishing collaborations in the fields of training, academic exchanges, and digital development projects."},
  {"Q": "What are the details of the signed agreements?", "A": "ESTIN has signed agreements with organizations such as Huawei, the University of Bejaia, Ooredoo, and Cisco Networking Academy, addressing topics like cooperation, student and internship exchanges."},
  {"Q": "What are the main objectives of the agreements?", "A": "The objectives include training and skill development for students, the exchange of teachers and students, and the implementation of digital development projects."},
  {"Q": "How does ESTIN choose its partners for agreements?", "A": "ESTIN selects its partners based on the relevance of the projects, the quality of the programs, and their alignment with its academic and professional goals."},
  {"Q": "Who can benefit from cooperation and exchange programs?", "A": "Students and teachers from ESTIN, as well as partner organizations involved in the exchanges and projects."},
  {"Q": "What types of continuing education are offered?", "A": "ESTIN offers high-quality training in various fields such as computer science, economics/management, marketing, and many others."},
  {"Q": "What are the training topics offered in computer science?", "A": "The topics include Python programming for Data Science, Data Mining, Deep Learning, Cisco (CCNA, CCNP), GNU/Linux operating systems, and more."},
  {"Q": "What training is available in economics and management?", "A": "Training in economics and management includes audit and risk management, corporate finance, human resources management, and leadership."},
  {"Q": "What types of language training are offered?", "A": "Language training includes communication English, scientific English, as well as courses in Turkish and Amazigh languages."},
  {"Q": "Are there courses in law and ethics?", "A": "Yes, the school offers training on digital law and counterfeit medicines."},
  {"Q": "What training is offered in the health field?", "A": "Health training includes pharmacology, managing intoxications, and drug development."},
  {"Q": "Does the school offer pedagogy training?", "A": "Yes, there are courses on scientific research methodology and pedagogy in the field of computer science."},
  {"Q": "What programs are offered by ESTIN?", "A": "ESTIN offers various programs in computer science, digital technologies, and other related fields. Detailed information can be found on ESTIN's program page at https://estin.dz/programme-de-formation/."},
  {"Q": "What is the ESTIN admission criteria?", "A": "Admission is based on a weighted average, typically requiring a high baccalaureate score. Specific criteria vary annually."},
  {"Q": "How can I register for courses?", "A": "Course registration is done via the PROGRES platform. Deadlines and detailed instructions are communicated on the website."},
  {"Q": "What are the steps to apply for an internship?", "A": "Visit the secretariat or check the internship guide available on the ESTIN website."},
  {"Q": "Who should I contact for scholarship issues?", "A": "Contact the Scholarship Office via email at scolarite@estin.dz."},
  {"Q": "Where can I get a certified copy of my BAC transcript?", "A": "Submit your BAC transcript to Office #2 and collect the certified copy after 4 days."},
  {"Q": "Can I request academic leave online?", "A": "Yes, you can download the academic leave form from the website, fill it out, and submit it to the Pedagogy Department."},
  {"Q": "How can I obtain a certificate of enrollment?", "A": "Certificates of enrollment can be requested from the administration office or downloaded from the PROGRES platform."},
  {"Q": "Where is ESTIN located?", "A": "ESTIN is located at MW77+F23, N75, Amizour, Béjaia. GPS coordinates are available at https://maps.app.goo.gl/1YuyXPKLZEhNxt4f7."},
  {"Q": "How do I contact the IT department for technical issues?", "A": "Send an email to ing_ouaret@estin.dz or ing_guellal@estin.dz."},
  {"Q": "How can I join a school club?", "A": "Contact the cultural activities service at activites_culturelles@estin.dz."},
  {"Q": "What are the library hours?", "A": "Library hours are published on the ESTIN website or can be inquired via bibliotheque@estin.dz."},
  {"Q": "Who do I contact for security issues?", "A": "Contact the security officer, Mr. AOUGHLIS Nabil, at surete@estin.dz."},
  {"Q": "How can I enroll in doctoral programs?", "A": "Details about doctoral programs are managed by the deputy director in charge of doctoral training. Visit Office #12 for assistance."},
  {"Q": "What resources are available for research at ESTIN?", "A": "Research support includes access to laboratories, a digital library, and faculty mentors. Contact the research office for more details."},
  {"Q": "What are the steps to publish a paper through ESTIN?", "A": "Papers should follow ESTIN's publishing guidelines. Ensure your affiliation is listed correctly to avoid rejections."},
  {"Q": "How can I apply for academic leave?", "A": "Submit a complete dossier before exams to Office #2 or Office #3 for consideration."},
  {"Q": "What documents are required for academic leave?", "A": "You need a completed academic leave request form, supporting documents (e.g., medical reports, sworn statement), and clearance from relevant departments."},
  {"Q": "What is the procedure for re-enrollment after academic leave?", "A": "Submit your re-enrollment application along with a copy of the academic leave decision and supporting documents, if applicable."},
  {"Q": "What are the main administrative bodies of ESTIN?", "A": "ESTIN is administered by a Director, a Board of Directors, and a Scientific Council."},
  {"Q": "What are the responsibilities of the Secretary General?", "A": "The Secretary General oversees personnel management, finances, cultural activities, and logistics."},
  {"Q": "How do I contact the Deputy Director for Scientific Research?", "A": "You can reach the Deputy Director at the office in charge of doctoral training and scientific research (Office #12)."},
  {"Q": "Who manages external relations at ESTIN?", "A": "The Deputy Director of Information Systems and Communication handles external relations."},
  {"Q": "Where can I find the list of teachers at ESTIN?", "A": "The list of teachers is available on the ESTIN website at https://estin.dz/annuaire-des-enseignants/."},
  {"Q": "What is the ESTIN pre-registration process?", "A": "Pre-registration is completed online via the Ministry's orientation platform. Visit https://www.orientation-esi.dz for details."},
  {"Q": "What is the deadline for confirming pre-registration?", "A": "The deadline for confirmation varies annually but is typically announced on the ESTIN website and the Ministry portal."},
  {"Q": "Where can I find information about ESTIN's training programs?", "A": "Information about training programs is available at https://estin.dz/programme-de-formation/."},
  {"Q": "How do I report issues with online platforms like Moodle or Elearn?", "A": "Send a message to ing_ouaret@estin.dz or ing_guellal@estin.dz for support."},
  {"Q": "What is the location of ESTIN's student accommodations?", "A": "Student accommodations are located at Berchiche 3 residence and Amizour 2 residence. Contact the DOUB office for more details."},
  {"Q": "What is the process to request a duplicate of a document?", "A": "Submit a legalized sworn statement at the town hall and bring it to Office #2 or Office #3."},
  {"Q": "Who handles student health services?", "A": "Student health services are managed by the ESTIN medical center. Contact medecin@estin.dz for assistance."},
  {"Q": "How do I schedule a meeting with a teacher or staff member?", "A": "Contact the teacher or staff member via their official email provided on the ESTIN directory."},
  {"Q": "What are the school club activities at ESTIN?", "A": "ESTIN supports various clubs focusing on culture, technology, and innovation. Contact activites_culturelles@estin.dz for more details."},
  {"Q": "How can I participate in ESTIN's cultural events?", "A": "Sign up through the cultural activities office or email activites_culturelles@estin.dz."},
  {"Q": "Where can I find updates and news about ESTIN?", "A": "Visit https://estin.dz/category/actualites/ for the latest updates and announcements."},
  {"Q": "What is the role of the Deputy Director of Education?", "A": "The Deputy Director of Education manages services related to teaching, diplomas, and continuous training."},
  {"Q": "Where can I obtain an enrollment certificate?", "A": "You can request an enrollment certificate from the admissions office or download it from the PROGRES platform."},
  {"Q": "What are the requirements to join ESTIN?", "A": "Admission is based on academic performance, particularly baccalaureate scores, and other criteria set by the Ministry."},
  {"Q": "What is the contact for ESTIN's administrative services?", "A": "General inquiries can be directed to scolarite@estin.dz or via phone at the administrative office."},
  {"Q": "What are the reception days for students?", "A": "Students can visit the administration on Sundays, Tuesdays, and Thursdays."},
  {"Q": "What are the library hours at ESTIN?", "A": "Library hours vary each semester and are announced on the ESTIN website or through email notifications."},
  {"Q": "When are student receptions scheduled?", "A": "Student receptions are scheduled on Sundays, Tuesdays, and Thursdays during working hours."},
  {"Q": "What are the working hours of the ESTIN administrative offices?", "A": "Administrative offices are open from 8:00 AM to 4:00 PM, Sunday through Thursday."},
  {"Q": "When can students apply for academic leave?", "A": "Academic leave applications are accepted before exams and within the deadlines announced by the administration."},
  {"Q": "What are the deadlines for course registrations?", "A": "Deadlines for course registrations are published at the start of each semester on the ESTIN website and noticeboards."},
  {"Q": "When is the timetable for classes released?", "A": "Class schedules are released a week before the start of the semester and are available on the noticeboards and the ESTIN website."},
  {"Q": "How can I find my exam schedule?", "A": "Exam schedules are posted on the ESTIN website and on noticeboards two weeks before the exam period."},
  {"Q": "What are the deadlines for finalizing academic registration?", "A": "Deadlines for finalizing registration are announced via email and on the ESTIN website before the semester begins."},
  {"Q": "When are the open days for new students?", "A": "Open days for new students are typically scheduled a week before the academic year starts. Exact dates are announced on the website."},
  {"Q": "What are the office hours for the Pedagogy Department?", "A": "The Pedagogy Department is open from 9:00 AM to 3:30 PM, Sunday through Thursday."},
  {"Q": "When is the deadline for submitting internship reports?", "A": "The deadline for submitting internship reports is usually two weeks after the end of the internship period, as specified by the academic calendar."},
  {"Q": "When are the midterm exams scheduled?", "A": "Midterm exams are typically scheduled halfway through the semester, with exact dates announced in the academic calendar."},
  {"Q": "When does the semester begin?", "A": "The semester start date is announced on the academic calendar, available on the ESTIN website."},
  {"Q": "How can I check my group’s class schedule?", "A": "Group schedules are posted on the noticeboards and can also be accessed through the ESTIN student portal."},
  {"Q": "What is the schedule for teacher office hours?", "A": "Teacher office hours vary and are announced at the beginning of the semester. They can be found in the course syllabus or via email communication."},
  {"Q": "When are the final exams conducted?", "A": "Final exams are conducted during the last two weeks of the semester. Specific dates are provided in the academic calendar."},
  {"Q": "What are the deadlines for scholarship applications?", "A": "Scholarship application deadlines are set in August, and details are communicated via the ESTIN website and emails."},
  {"Q": "When are the group assignment schedules released?", "A": "Group assignment schedules are released during the first week of the semester and are available on noticeboards."},
  {"Q": "What are the deadlines for submitting re-enrollment requests after academic leave?", "A": "Re-enrollment requests must be submitted at least two weeks before the semester starts."},
  {"Q": "What specializations are offered at ESTIN?", "A": "ESTIN offers specializations in fields such as artificial intelligence, software engineering, cybersecurity, data science, and digital systems."},
  {"Q": "What is the focus of the Artificial Intelligence specialization?", "A": "The AI specialization focuses on machine learning, natural language processing, robotics, and advanced data analytics."},
  {"Q": "What courses are included in the Software Engineering specialization?", "A": "Courses include software design, development methodologies, testing, and project management."},
  {"Q": "What does the Cybersecurity specialization cover?", "A": "Cybersecurity includes courses on network security, cryptography, ethical hacking, and risk management."},
  {"Q": "What is the scope of the Data Science specialization?", "A": "Data Science covers data mining, statistical analysis, visualization techniques, and big data technologies."},
  {"Q": "What topics are covered in the Digital Systems specialization?", "A": "Topics include embedded systems, IoT (Internet of Things), digital circuits, and system-on-chip design."},
  {"Q": "Are there any elective courses in the specializations?", "A": "Yes, students can choose electives such as blockchain technology, mobile app development, and cloud computing based on their interests."},
  {"Q": "What industries are targeted by ESTIN specializations?", "A": "Industries include IT services, healthcare, finance, manufacturing, and telecommunications, among others."},
  {"Q": "Are internships mandatory in the specializations?", "A": "Yes, internships are a core part of all specializations, providing hands-on experience in real-world scenarios."},
  {"Q": "What are the career prospects for graduates of ESTIN specializations?", "A": "Graduates can work as software developers, data scientists, cybersecurity analysts, AI researchers, and system architects."},
  {"Q": "How is the curriculum structured for specializations?", "A": "The curriculum includes a mix of core courses, specialization-specific courses, practical labs, and a final year project."},
  {"Q": "What is the capstone project in specializations?", "A": "The capstone project is a final-year assignment where students work on solving real-world problems using their specialized knowledge."},
  {"Q": "Can students switch specializations during their studies?", "A": "Switching specializations is possible, but it requires approval from the academic advisor and depends on course availability."},
  {"Q": "What resources are available for specialization students?", "A": "Resources include access to state-of-the-art labs, software tools, digital libraries, and mentorship from faculty."},
  {"Q": "Are there research opportunities within the specializations?", "A": "Yes, students can participate in research projects related to their specialization under faculty supervision."},
  {"Q": "What programming languages are taught in ESTIN specializations?", "A": "Programming languages such as Python, Java, C++, and R are commonly included in the curriculum."},
  {"Q": "Are there partnerships with industries for specialization students?", "A": "Yes, ESTIN collaborates with industry leaders like Huawei, Cisco, and local tech companies for internships and projects."},
  {"Q": "What is the admission process for a specific specialization?", "A": "Admission to specializations typically occurs in the second or third year, based on academic performance and student preference."},
  {"Q": "How are practical skills developed in specializations?", "A": "Through hands-on labs, workshops, hackathons, and industry-sponsored projects."},
  {"Q": "What certifications can be earned during specialization studies?", "A": "Students can earn certifications like Cisco CCNA, AWS Certified Developer, and Microsoft Azure Fundamentals depending on their courses."},
  {"Q": "How can I pre-register for ESTIN?", "A": "Pre-registration is done online through the official platform at https://www.orientation-esi.dz during the designated period."},
  {"Q": "What documents are required for final registration?", "A": "Required documents include the original baccalaureate transcript, two ID photos, a payment receipt of 200 DA, and the assignment certificate."},
  {"Q": "What is the ESTIN code for pre-registration?", "A": "The ESTIN pre-registration code is C00CAN03."},
  {"Q": "When is the pre-registration period?", "A": "The pre-registration period is typically announced in July or August, with exact dates available on the ESTIN website and Ministry portal."},
  {"Q": "What happens after pre-registration?", "A": "Pre-registration results are published, and students must confirm their choice within the deadline specified on the platform."},
  {"Q": "What is the procedure if a student does not get their preferred assignment?", "A": "Students can reapply for a new pre-registration during the second round, as indicated by the Ministry."},
  {"Q": "When are final registrations conducted?", "A": "Final registrations are typically held in early September through the PROGRES platform."},
  {"Q": "How do I confirm my pre-registration?", "A": "Log in to the pre-registration platform at https://www.orientation-esi.dz and confirm your choice by the deadline."},
  {"Q": "What is the deadline for finalizing registration?", "A": "The deadline for finalizing registration is announced on the ESTIN website and communicated via email to enrolled students."},
  {"Q": "How do I register for the academic year if I am a returning student?", "A": "Returning students must re-enroll by submitting required documents and paying the registration fee through the PROGRES platform."},
  {"Q": "What is the process for registering for courses?", "A": "Course registration is completed online through the student portal or by visiting the Pedagogy Department."},
  {"Q": "Can international students apply to ESTIN?", "A": "Yes, international students can apply through the Ministry's international student platform. Required documents and deadlines are specified on the ESTIN website."},
  {"Q": "What should I do if I miss the registration deadline?", "A": "Contact the administration immediately to check for possible extensions or alternative registration options."},
  {"Q": "Where can I find help with the registration process?", "A": "For assistance, visit the administration office or contact the admissions team via email at scolarite@estin.dz."},
  {"Q": "What is the fee for registration?", "A": "The registration fee is 200 DA, payable during the registration process."},
  {"Q": "What are the important dates for registration?", "A": "Key dates for pre-registration, confirmation, and final registration are published on the ESTIN website and communicated via email."},
  {"Q": "How do I apply for a scholarship during registration?", "A": "Scholarship applications can be submitted through the university services portal during the registration period."},
  {"Q": "What happens if my documents are incomplete during registration?", "A": "Incomplete documents may delay your registration. Ensure all required documents are submitted before the deadline."},
  {"Q": "Is there a specific office for registration issues?", "A": "Yes, visit the Pedagogy Department or the administrative office for any registration-related concerns."},
  {"Q": "Can I update my registration details after submission?", "A": "Updates to registration details must be requested through the administration office or via email within the allowed timeframe."},
  {"Q": "What is the third cycle of education at ESTIN?", "A": "The third cycle refers to doctoral studies focusing on research, innovation, and advanced training in specialized fields."},
  {"Q": "How long is the doctoral program at ESTIN?", "A": "The doctoral program typically lasts three (3) years, with the possibility of a one- or two-year extension upon request."},
  {"Q": "What are the requirements to enroll in the third cycle at ESTIN?", "A": "Candidates must hold a Master’s degree in a relevant field and meet the specific admission criteria set by the doctoral school."},
  {"Q": "What fields of study are available for doctoral research?", "A": "Fields include computer science, artificial intelligence, data science, digital systems, and cybersecurity."},
  {"Q": "How can I apply for the doctoral program?", "A": "Applications must be submitted through the designated platform or directly to the doctoral school with the required documents."},
  {"Q": "What is the role of the Doctoral Training Committee (CFD)?", "A": "The CFD oversees doctoral training, ensures the progression of students, and approves the composition of thesis defense juries."},
  {"Q": "What is the content of a doctoral student's logbook?", "A": "The logbook tracks the student’s training, completed courses, publications, and evaluation results."},
  {"Q": "Can I pursue a co-supervised (cotutelle) thesis?", "A": "Yes, co-supervised theses allow collaboration between ESTIN and a foreign institution with advisors from both sides."},
  {"Q": "What is required for a thesis defense?", "A": "A favorable report from the thesis advisor, at least 180 points earned through research, training, and publications, and adherence to evaluation criteria."},
  {"Q": "How are points distributed for thesis defense?", "A": "Points are distributed as follows: 100 for the thesis, 30 for completed training, and a minimum of 50 for scientific work."},
  {"Q": "What happens if plagiarism is detected in a thesis?", "A": "Plagiarism can lead to the cancellation of the thesis defense, revocation of the title, and other disciplinary actions."},
  {"Q": "Are there specific regulations for doctoral training?", "A": "Yes, the training is governed by national decrees and internal ESTIN guidelines, such as Decree 10-231 and Order No. 28."},
  {"Q": "What are the research facilities available for doctoral students?", "A": "Facilities include advanced laboratories, access to scientific journals, and collaboration opportunities with industry partners."},
  {"Q": "What is the role of the supervisor in doctoral studies?", "A": "The supervisor guides the student’s research, provides mentorship, and evaluates progress."},
  {"Q": "Can I publish my research during the doctoral program?", "A": "Yes, publishing in recognized journals is encouraged and required for completing the doctoral program."},
  {"Q": "Are there scholarships for doctoral students?", "A": "Scholarships may be available through research grants or external funding programs."},
  {"Q": "What is the Guide Doctoral?", "A": "The Guide Doctoral outlines the rules and procedures for doctoral training, applicable to students enrolled at ESTIN."},
  {"Q": "What is the process for forming a thesis defense jury?", "A": "The jury is proposed by the supervisor and approved by the Doctoral Training Committee, adhering to national regulations."},
  {"Q": "How can I extend the duration of my doctoral studies?", "A": "Extensions must be requested through the doctoral school with justification, subject to approval by the administration."},
  {"Q": "What are the criteria for evaluating scientific journals?", "A": "Journals are categorized by quality (A, B, etc.) as determined by the National Scientific Commission, and only approved journals are accepted for defense."},
  {"Q": "When are midterm exams scheduled?", "A": "Midterm exams are typically conducted halfway through the semester. Specific dates are announced on the academic calendar."},
  {"Q": "When are final exams held?", "A": "Final exams are held during the last two weeks of the semester, as specified in the academic calendar."},
  {"Q": "How can I find my exam schedule?", "A": "Exam schedules are published on the ESTIN website and noticeboards at least two weeks before the exam period."},
  {"Q": "What happens if I miss an exam?", "A": "Students who miss exams due to valid reasons must provide documentation, such as medical justification, to the Pedagogy Department to request a reschedule."},
  {"Q": "What is the grading system used at ESTIN?", "A": "Grades are typically assigned on a scale of 0 to 20, with 10 being the minimum passing score for most courses."},
  {"Q": "How are practical courses evaluated?", "A": "Practical courses are evaluated based on lab work, reports, and continuous assessment throughout the semester."},
  {"Q": "What is the weight of exams in the final grade?", "A": "The weight of exams varies by course but is typically 60-70% of the final grade, with continuous assessment covering the remainder."},
  {"Q": "Can I retake exams if I fail a course?", "A": "Yes, retake exams are offered during the designated period. Students must register for these exams with the administration."},
  {"Q": "How are projects and assignments evaluated?", "A": "Projects and assignments are graded based on criteria such as content quality, presentation, and adherence to deadlines."},
  {"Q": "What is the process for grade appeals?", "A": "Grade appeals must be submitted in writing to the Pedagogy Department within the specified timeframe after grades are released."},
  {"Q": "What should I do if I have a conflict in my exam schedule?", "A": "Report the conflict to the Pedagogy Department immediately to request an adjustment."},
  {"Q": "Are oral exams part of the evaluation process?", "A": "Oral exams may be included for specific courses, especially in language and communication-related subjects."},
  {"Q": "What is the policy for continuous assessment?", "A": "Continuous assessment includes quizzes, assignments, participation, and other activities, contributing 30-40% of the final grade."},
  {"Q": "When are the grades published?", "A": "Grades are typically published within two weeks after the exam period on the student portal or noticeboards."},
  {"Q": "Can I review my exam scripts?", "A": "Yes, students may request to review their exam scripts by contacting the course instructor or the Pedagogy Department."},
  {"Q": "What is the passing grade for final exams?", "A": "The minimum passing grade for final exams is typically 10/20, though it may vary for some courses."},
  {"Q": "How is group work evaluated?", "A": "Group work is evaluated based on the collective output, individual contributions, and peer evaluations when applicable."},
  {"Q": "What is the policy for plagiarism in assignments and exams?", "A": "Plagiarism is strictly prohibited and may result in disciplinary actions, including a failing grade for the course."},
  {"Q": "Are there mock exams available for students?", "A": "Mock exams may be organized for some courses to help students prepare for the official exams. Check with your instructor for availability."},
  {"Q": "What should I do if I encounter technical issues during an online exam?", "A": "Immediately report the issue to the IT Department and the course instructor to seek assistance and avoid penalties."},
  {"Q": "What should I do if I lose my exam admission card?", "A": "Contact the Pedagogy Department immediately to request a duplicate admission card."},
  {"Q": "Are calculators allowed during exams?", "A": "The use of calculators is allowed only for specific courses where indicated by the instructor. Ensure it is a non-programmable calculator if required."},
  {"Q": "What is the policy for late arrivals to exams?", "A": "Students arriving late may still take the exam, provided they arrive within the first 30 minutes of the scheduled start time. Beyond that, they may be denied entry."},
  {"Q": "What is the procedure for reporting exam misconduct?", "A": "Report any misconduct to the invigilator during the exam or to the Pedagogy Department immediately afterward."},
  {"Q": "How are final year project evaluations conducted?", "A": "Final year projects are evaluated by a jury based on a written report, oral presentation, and practical demonstration."},
  {"Q": "What happens if I am caught cheating during an exam?", "A": "Cheating is a serious offense and may result in penalties, including disqualification from the exam and further disciplinary actions."},
  {"Q": "Are there any accommodations for students with special needs during exams?", "A": "Yes, students with special needs can request accommodations such as extended time or specific seating arrangements by contacting the Pedagogy Department in advance."},
  {"Q": "What is the format of final exams?", "A": "Final exams may include multiple-choice questions, short answers, essays, problem-solving tasks, or practical components, depending on the course."},
  {"Q": "Can I request to take exams on different dates for personal reasons?", "A": "Exam date changes are generally not permitted unless under exceptional circumstances approved by the administration."},
  {"Q": "How is attendance factored into evaluation?", "A": "Attendance may count as part of continuous assessment in some courses, particularly those with practical components."},
  {"Q": "What is the policy for submitting assignments late?", "A": "Late submissions may incur penalties or may not be accepted, depending on the instructor's policy."},
  {"Q": "How are oral defense exams for projects structured?", "A": "Oral defense exams typically include a presentation of your project, followed by a Q&A session with a jury."},
  {"Q": "What are the rules for using electronic devices during exams?", "A": "Electronic devices, except approved calculators, are strictly prohibited during exams."},
  {"Q": "How are online exams monitored?", "A": "Online exams are monitored using proctoring software to ensure academic integrity and prevent cheating."},
  {"Q": "When are make-up exams scheduled?", "A": "Make-up exams are scheduled shortly after the regular exam period, with specific dates announced by the administration."},
  {"Q": "What documentation is required for requesting a make-up exam?", "A": "Submit valid documentation, such as a medical certificate or official proof of emergency, to the Pedagogy Department."},
  {"Q": "Are grades curved in any courses?", "A": "Grade curving policies depend on the instructor and the department. Check with your course instructor for details."},
  {"Q": "How are practical lab exams conducted?", "A": "Lab exams involve performing specific tasks or experiments, followed by a written or oral explanation of the results."},
  {"Q": "What happens if technical issues occur during a digital exam?", "A": "Immediately inform the invigilator or IT support team. A reschedule or continuation may be arranged based on the severity of the issue."},
  {"Q": "Can students request extra time for exams?", "A": "Extra time is granted only to students with approved accommodations for special needs or medical reasons."},
  {"Q": "What is the policy for re-evaluation of exam papers?", "A": "Re-evaluation requests must be submitted within the deadline set by the Pedagogy Department, accompanied by a valid reason."},
  {"Q": "Are there specific dress codes for exams?", "A": "While no strict dress code exists, students are expected to dress modestly and appropriately for exam sessions."},
  {"Q": "How are group exams evaluated?", "A": "Group exams are graded based on collective performance, with individual contributions assessed in some cases."},
  {"Q": "Can students request feedback on their exam performance?", "A": "Yes, students can request feedback by contacting their course instructor or attending scheduled feedback sessions."},
  {"Q": "What should I do if I have back-to-back exams?", "A": "Inform the Pedagogy Department in advance to explore potential adjustments, though such changes are rare."},
  {"Q": "Are there penalties for leaving the exam room early?", "A": "Students may leave the exam room only after the first 30 minutes. Leaving early without valid reasons may result in forfeiture of the exam attempt."}, 
  {"Q": "What should I bring to the exam room?", "A": "Students should bring their student ID card, exam admission card, and any required tools like pens, pencils, or non-programmable calculators."},
  {"Q": "Can I leave the exam room temporarily?", "A": "Students may leave temporarily only with invigilator permission, and they must be accompanied by a supervisor if necessary."},
  {"Q": "What is the policy for open-book exams?", "A": "Open-book exams allow students to bring specific materials, as defined by the course instructor. Unauthorized materials are strictly prohibited."},
  {"Q": "Are there specific seating arrangements for exams?", "A": "Yes, seating arrangements are assigned and posted outside the exam room before the exam starts."},
  {"Q": "What is the duration of exams?", "A": "Exam durations vary by course and level, typically ranging from one to three hours."},
  {"Q": "How can I verify my exam results?", "A": "Exam results are published on the student portal and displayed on noticeboards. Students can also request clarification from their instructor."},
  {"Q": "What is the policy for reporting exam errors or inconsistencies?", "A": "Report any errors or inconsistencies to the invigilator during the exam or to the course instructor immediately after."},
  {"Q": "What happens if I am absent from an exam without justification?", "A": "Unjustified absences result in a failing grade for the exam. Students must provide valid documentation to request a reschedule."},
  {"Q": "Are re-sit exams offered for all courses?", "A": "Re-sit exams are available for most courses, but students must register for them with the administration office."},
  {"Q": "What are the rules for submitting projects and dissertations?", "A": "Projects and dissertations must be submitted by the deadline specified by the instructor or department. Late submissions may not be accepted."},
  {"Q": "What should I do if I suspect an error in my grade?", "A": "Submit a formal grade review request to the Pedagogy Department within the allowed timeframe after grades are published."},
  {"Q": "Can I request to defer my exams?", "A": "Exam deferrals are allowed in exceptional circumstances, such as medical emergencies, and must be approved by the administration."},
  {"Q": "What happens if there is a power outage during an exam?", "A": "In case of a power outage, the exam may be paused and resumed once power is restored, or rescheduled if necessary."},
  {"Q": "How are practical exams for engineering courses conducted?", "A": "Practical exams involve hands-on tasks, problem-solving exercises, or technical demonstrations in the lab environment."},
  {"Q": "Are there specific guidelines for thesis defense exams?", "A": "Yes, thesis defense exams include an oral presentation, Q&A session with a jury, and evaluation based on the quality of work and presentation."},
  {"Q": "What should I do if I need special assistance during exams?", "A": "Contact the Pedagogy Department in advance to arrange accommodations such as extra time, assistive devices, or accessible seating."},
  {"Q": "Are midterm exams mandatory for all courses?", "A": "Midterm exams are mandatory for most courses, as they contribute to the final grade. Exceptions are specified by the course instructor."},
  {"Q": "What is the policy for submitting digital assignments?", "A": "Digital assignments must be submitted through the designated platform before the deadline. Late submissions may incur penalties."},
  {"Q": "Can I request to retake an exam to improve my grade?", "A": "Grade improvement exams are not typically allowed unless the student has failed the course. Check with the administration for exceptions."},
  {"Q": "How are final grades calculated?", "A": "Final grades are calculated based on a combination of continuous assessment, midterm exams, final exams, and practical evaluations."},
  {"Q": "What is the process for reporting exam-related grievances?", "A": "Submit a grievance form to the Pedagogy Department, outlining the issue and providing supporting evidence, if applicable."},
  {"Q": "Are there specific rules for online proctored exams?", "A": "Yes, students must have a stable internet connection, a functional webcam, and follow proctoring guidelines to maintain exam integrity."},
  {"Q": "What is the policy for late arrivals during practical exams?", "A": "Late arrivals for practical exams may be allowed at the instructor's discretion, but the student may not receive additional time to complete the task."},
  {"Q": "How is academic honesty monitored during exams?", "A": "Invigilators monitor students during in-person exams, and online exams use proctoring tools to detect cheating or misconduct."},
  {"Q": "What are the requirements for group presentations in evaluations?", "A": "Group presentations require all members to participate actively, and evaluations are based on content, teamwork, and individual contributions."},
  {"Q": "Can I bring food or drinks to the exam room?", "A": "Food and drinks are generally not allowed in the exam room, except for water bottles, which must have no labels."},
  {"Q": "What happens if I cannot finish the exam within the allotted time?", "A": "Unfinished exams will be graded based on the answers provided within the allotted time. Additional time is not granted unless pre-approved accommodations exist."},
  {"Q": "How are lab-based courses evaluated?", "A": "Lab-based courses are assessed through lab reports, practical exams, and continuous observation of skills and participation."},
  {"Q": "What should I do if I experience technical issues with my student portal before exams?", "A": "Contact the IT department at ESTIN immediately to resolve the issue and ensure access to your exam details."},
  {"Q": "What research laboratories are available at ESTIN?", "A": "ESTIN hosts several laboratories focused on fields like artificial intelligence, cybersecurity, data science, and digital technologies."},
  {"Q": "What is the LITAN laboratory?", "A": "LITAN stands for the Laboratory for Innovation in Information and Communication Technologies and Applied Mathematics. It focuses on research in IT and applied sciences."},
  {"Q": "How can I join a research laboratory at ESTIN?", "A": "Students and researchers can apply to join a lab by contacting the lab director or submitting a proposal through the Research Department."},
  {"Q": "What are the main research areas at ESTIN?", "A": "Key research areas include machine learning, network security, IoT, software development, and computational mathematics."},
  {"Q": "Are there collaboration opportunities with external organizations?", "A": "Yes, ESTIN laboratories frequently collaborate with industry leaders and academic institutions for joint research projects."},
  {"Q": "What facilities are available in ESTIN's laboratories?", "A": "Facilities include high-performance computing systems, IoT development kits, simulation tools, and advanced software for research."},
  {"Q": "Can undergraduate students participate in laboratory research?", "A": "Yes, undergraduate students can participate in research projects as assistants or through internships in collaboration with the laboratories."},
  {"Q": "What types of projects are conducted in the cybersecurity lab?", "A": "Projects in the cybersecurity lab focus on penetration testing, cryptography, secure communication protocols, and risk analysis."},
  {"Q": "How are research topics selected in laboratories?", "A": "Research topics are selected based on current technological challenges, academic trends, and funding opportunities from partners."},
  {"Q": "Are there funding opportunities for research at ESTIN?", "A": "Yes, funding is available through national grants, international collaborations, and industry partnerships."},
  {"Q": "How can doctoral students benefit from ESTIN's laboratories?", "A": "Doctoral students can use laboratory resources for experiments, access mentors for guidance, and collaborate on advanced research topics."},
  {"Q": "What is the focus of the IoT research group?", "A": "The IoT research group focuses on developing smart devices, IoT security, and applications in smart cities and healthcare."},
  {"Q": "Can external researchers collaborate with ESTIN laboratories?", "A": "Yes, external researchers can collaborate by submitting a proposal or partnering through institutional agreements."},
  {"Q": "What is the role of the Data Science Laboratory?", "A": "The Data Science Laboratory focuses on big data analytics, machine learning algorithms, and real-world data-driven solutions."},
  {"Q": "Are there workshops or training sessions conducted by the laboratories?", "A": "Yes, ESTIN laboratories regularly conduct workshops, seminars, and training sessions on specialized research topics."},
  {"Q": "What is the procedure for publishing research conducted in the laboratories?", "A": "Research must adhere to publication guidelines and include proper affiliation to ESTIN. Papers are reviewed and submitted to academic journals or conferences."},
  {"Q": "Are students encouraged to publish their research work?", "A": "Yes, students are encouraged to publish in recognized journals or present their findings at academic conferences."},
  {"Q": "How are laboratory research projects evaluated?", "A": "Projects are evaluated based on innovation, practical applications, and contributions to the scientific community."},
  {"Q": "What are the eligibility criteria to work in an ESTIN lab?", "A": "Eligibility criteria include enrollment at ESTIN, a strong academic record, and alignment of research interests with the lab's focus."},
  {"Q": "What role do faculty members play in laboratory research?", "A": "Faculty members lead research groups, mentor students, secure funding, and collaborate with external partners for advancing laboratory goals."},
  {"Q": "Are there any student clubs associated with ESTIN laboratories?", "A": "Yes, some student clubs, like robotics or programming clubs, work closely with laboratories for innovation and skill development."},
  {"Q": "What achievements have ESTIN laboratories contributed to?", "A": "ESTIN labs have contributed to breakthroughs in AI, IoT, and cybersecurity and have published research in high-impact journals."},
  {"Q": "How can I access laboratory facilities for independent research?", "A": "Independent access requires approval from the lab director and adherence to ESTIN’s research policies."},
  {"Q": "What collaborations exist between ESTIN laboratories and international universities?", "A": "ESTIN labs collaborate with international universities on joint research projects, exchange programs, and co-publications."},
  {"Q": "Are there competitions or challenges hosted by the laboratories?", "A": "Yes, ESTIN laboratories often host hackathons, coding challenges, and research competitions to encourage innovation."},
  {"Q": "What is the role of research assistants in the laboratories?", "A": "Research assistants support ongoing projects, manage experiments, and contribute to research publications."},
  {"Q": "Can laboratory research lead to patents?", "A": "Yes, innovative research conducted in ESTIN laboratories can lead to patents, often in collaboration with industrial partners."},
  {"Q": "What is the primary goal of ESTIN's research laboratories?", "A": "The primary goal is to drive innovation, solve real-world problems, and contribute to advancements in technology and science."},
  {"Q": "What types of scientific publications are produced at ESTIN?", "A": "ESTIN produces journal articles, conference papers, book chapters, and technical reports in fields like computer science, data science, and digital technologies."},
  {"Q": "Where can I find ESTIN's scientific publications?", "A": "Publications are available on academic platforms such as Google Scholar, ResearchGate, and the ESTIN website under the Research section."},
  {"Q": "What are the guidelines for publishing scientific work at ESTIN?", "A": "Publications must adhere to the ESTIN affiliation format, follow ethical guidelines, and meet the quality standards of the targeted journal or conference."},
  {"Q": "What is the affiliation format for ESTIN researchers?", "A": "The correct affiliation format is: LITAN Laboratory, Higher School of Computer Science and Digital Technologies (ESTIN), RN 75, Amizour 06300, Bejaia, Algeria."},
  {"Q": "What happens if a publication does not include the correct affiliation?", "A": "Publications without the proper affiliation will not be considered for doctoral defenses or habilitation applications."},
  {"Q": "What are the popular research topics for ESTIN publications?", "A": "Popular topics include artificial intelligence, cybersecurity, IoT, big data analytics, and computational mathematics."},
  {"Q": "Does ESTIN have its own scientific journal?", "A": "ESTIN may collaborate with scientific journals, but its primary focus is on contributing to high-impact international and national journals."},
  {"Q": "How can I publish my research as a student at ESTIN?", "A": "Students should collaborate with faculty advisors, follow publication guidelines, and target recognized journals or conferences."},
  {"Q": "What is the process for submitting a research paper?", "A": "Submit your paper through the appropriate journal or conference platform after ensuring it meets the submission guidelines."},
  {"Q": "Are there financial supports for publishing research?", "A": "Yes, ESTIN may provide financial support or facilitate funding for publishing in high-quality journals."},
  {"Q": "What are the criteria for selecting a journal for publication?", "A": "Journals are selected based on impact factor, relevance to the research field, and recognition by the National Scientific Commission."},
  {"Q": "Can undergraduate students publish research work?", "A": "Yes, undergraduate students can co-author papers with faculty members or participate in research projects that lead to publications."},
  {"Q": "Are publications mandatory for doctoral students at ESTIN?", "A": "Yes, doctoral students must publish at least one research paper in a recognized journal as part of their graduation requirements."},
  {"Q": "What is the role of conferences in ESTIN's scientific publications?", "A": "Conferences provide a platform for presenting research findings, networking, and receiving feedback before journal submission."},
  {"Q": "What are the consequences of plagiarism in publications?", "A": "Plagiarism is strictly prohibited and may result in paper rejection, academic penalties, and damage to professional reputation."},
  {"Q": "What scientific platforms does ESTIN use for publication dissemination?", "A": "ESTIN researchers use platforms like IEEE Xplore, Springer, Elsevier, and Scopus for disseminating their research."},
  {"Q": "Are collaborative publications encouraged at ESTIN?", "A": "Yes, ESTIN encourages collaborative publications with other institutions, industry partners, and international researchers."},
  {"Q": "How does ESTIN support open-access publications?", "A": "ESTIN supports open-access publications to ensure research findings are widely accessible to the scientific community and the public."},
  {"Q": "What is the average review time for scientific publications?", "A": "Review times vary by journal or conference but typically range from one to six months."},
  {"Q": "What types of recognition are given for outstanding publications at ESTIN?", "A": "Researchers with outstanding publications may receive awards, funding for further research, or recognition during ESTIN events."},
  {"Q": "How does ESTIN handle multi-author publications?", "A": "Multi-author publications should clearly specify each author's contribution and include all affiliations appropriately."},
  {"Q": "What is the role of the National Scientific Commission in ESTIN publications?", "A": "The National Scientific Commission evaluates and classifies journals, ensuring publications meet national quality standards."},
  {"Q": "Can ESTIN research lead to patents?", "A": "Yes, innovative research can lead to patents, particularly in fields like AI, IoT, and cybersecurity."},
  {"Q": "What support is available for preparing research papers?", "A": "ESTIN provides workshops, faculty mentorship, and access to writing tools and templates for preparing high-quality research papers."},
  {"Q": "How are collaborative international publications handled?", "A": "International collaborations are encouraged, and papers should include all contributing institutions' affiliations."},
  {"Q": "What is the procedure for withdrawing a submitted paper?", "A": "Contact the journal or conference editor with a formal request, including valid reasons for withdrawing the paper."},
  {"Q": "What are the ethical considerations for publishing at ESTIN?", "A": "Researchers must ensure originality, avoid plagiarism, acknowledge all contributors, and adhere to ethical research practices."},
  {"Q": "Are students required to present their research at conferences?", "A": "While not mandatory, presenting research at conferences is highly encouraged for gaining feedback and networking opportunities."},
  {"Q": "How are publications tracked and evaluated at ESTIN?", "A": "Publications are tracked through internal databases and evaluated based on impact, citations, and relevance to academic goals."},
  {"Q": "How can I contact a teacher at ESTIN?", "A": "You can contact teachers via their email addresses listed in the teacher directory at https://estin.dz/annuaire-des-enseignants/."},
  {"Q": "What is the role of a teacher at ESTIN?", "A": "Teachers are responsible for delivering lectures, supervising projects, conducting research, and mentoring students."},
  {"Q": "Are ESTIN teachers involved in research activities?", "A": "Yes, many teachers actively participate in research projects and contribute to publications in their respective fields."},
  {"Q": "How can I schedule a meeting with a teacher?", "A": "Meetings can be scheduled via email or during the teacher's office hours, which are announced at the beginning of the semester."},
  {"Q": "Can teachers supervise student projects?", "A": "Yes, teachers supervise undergraduate and graduate projects, providing guidance and support throughout the process."},
  {"Q": "What is the qualification of ESTIN teachers?", "A": "ESTIN teachers are highly qualified, holding advanced degrees such as Master's, PhD, or equivalent certifications in their respective fields."},
  {"Q": "Are there specialized teachers for different fields?", "A": "Yes, teachers specialize in areas like artificial intelligence, cybersecurity, software engineering, data science, and digital systems."},
  {"Q": "Do teachers provide support outside of class hours?", "A": "Yes, teachers are available during office hours and can also assist via email or the ESTIN online learning platforms."},
  {"Q": "How are teachers evaluated at ESTIN?", "A": "Teachers are evaluated based on student feedback, research contributions, teaching quality, and administrative responsibilities."},
  {"Q": "Can teachers assist with internship placements?", "A": "Yes, teachers often provide recommendations and guidance for securing internships relevant to the student's field of study."},
  {"Q": "Do teachers at ESTIN collaborate with industries?", "A": "Yes, many teachers collaborate with industries for research, internships, and real-world projects."},
  {"Q": "What is the role of teachers in student clubs?", "A": "Teachers may act as advisors or mentors for student clubs, supporting their activities and initiatives."},
  {"Q": "Are there teaching assistants at ESTIN?", "A": "Yes, some courses have teaching assistants who help with labs, tutorials, and grading."},
  {"Q": "How can I request a recommendation letter from a teacher?", "A": "You can request a recommendation letter by contacting the teacher via email and providing relevant details about your request."},
  {"Q": "Do teachers organize extracurricular workshops or seminars?", "A": "Yes, teachers frequently organize workshops, seminars, and hackathons to enhance student learning and skills."},
  {"Q": "What is the teacher-student ratio at ESTIN?", "A": "The teacher-student ratio varies by department but aims to ensure personalized attention and effective learning."},
  {"Q": "Can teachers help with publishing research papers?", "A": "Yes, teachers guide students in writing and publishing research papers, often as co-authors."},
  {"Q": "How do teachers integrate practical knowledge into their teaching?", "A": "Teachers use case studies, real-world examples, and hands-on projects to bridge theory with practical applications."},
  {"Q": "What are the teaching methods used by ESTIN teachers?", "A": "Teachers use a mix of lectures, interactive discussions, practical labs, and digital tools to enhance learning."},
  {"Q": "Are ESTIN teachers involved in international collaborations?", "A": "Yes, many teachers collaborate with international universities and research institutions for academic and research purposes."},
  {"Q": "Can teachers assist with academic difficulties?", "A": "Yes, teachers are available to support students facing academic challenges through additional sessions or tailored guidance."},
  {"Q": "What is the process for providing feedback to teachers?", "A": "Students can provide feedback through formal evaluations conducted by the administration or directly during meetings with teachers."},
  {"Q": "Do teachers participate in curriculum development?", "A": "Yes, teachers play a crucial role in designing and updating the curriculum to ensure it meets academic and industry standards."},
  {"Q": "How can I report issues related to teaching quality?", "A": "Students can report teaching-related concerns to the Pedagogy Department or through official feedback channels."},
  {"Q": "Do teachers provide mentorship for competitions or hackathons?", "A": "Yes, teachers mentor students for participating in national and international competitions, providing guidance and resources."},
  {"Q": "Are teachers involved in thesis supervision?", "A": "Yes, teachers supervise undergraduate, master's, and doctoral theses, helping students with research and writing."},
  {"Q": "Can I approach a teacher for career advice?", "A": "Yes, teachers often provide career guidance and insights into industry trends and opportunities."},
  {"Q": "Do teachers organize study groups or peer learning sessions?", "A": "While teachers encourage study groups, they may also organize peer learning sessions or assign group projects to foster collaboration."},
  {"Q": "How can I access teaching materials provided by teachers?", "A": "Teaching materials are shared through ESTIN’s e-learning platform or directly via email or printed handouts."},
  {"Q": "What is the Higher Schools Entrance Exam?", "A": "It is a competitive exam for admission to higher schools in Algeria, including ESTIN, designed to select the best candidates based on merit."},
  {"Q": "Who is eligible to take the Higher Schools Entrance Exam?", "A": "Students who have completed their baccalaureate with high scores in relevant fields such as mathematics, experimental sciences, and technical mathematics are eligible."},
  {"Q": "What subjects are covered in the Higher Schools Entrance Exam?", "A": "The exam typically covers mathematics, physics, chemistry, and general culture, depending on the target school and program."},
  {"Q": "When is the Higher Schools Entrance Exam held?", "A": "The competition is usually held during the summer, shortly after the baccalaureate results are announced. Specific dates are published by the Ministry of Higher Education."},
  {"Q": "How can I register for the Higher Schools Entrance Exam?", "A": "Registration is done online via the Ministry’s platform or through designated regional centers. Instructions are announced by the Ministry of Higher Education."},
  {"Q": "What is the admission process after the exam?", "A": "Admission is based on the competition rank, baccalaureate scores, and available seats in the desired program."},
  {"Q": "What is the passing score for the exam?", "A": "The passing score varies each year depending on the competition and the number of candidates, but only top-ranked students are admitted."},
  {"Q": "What documents are required for the exam?", "A": "Required documents include a copy of the baccalaureate certificate, identity card, recent photos, and the competition registration form."},
  {"Q": "Are there any preparatory courses for the exam?", "A": "Yes, some institutions and online platforms offer preparatory courses to help candidates review the subjects and practice past papers."},
  {"Q": "Can I retake the exam if I fail?", "A": "Candidates can take the exam only once, immediately after obtaining their baccalaureate."},
  {"Q": "What is the role of ESTIN in the Higher Schools Entrance Exam?", "A": "ESTIN is one of the higher schools that admit students through the competition, particularly for its programs in computer science and digital technologies."},
  {"Q": "Where can I find past papers or sample questions for the exam?", "A": "Past papers and sample questions are available on the Ministry's website or through preparatory course providers."},
  {"Q": "Is there a fee for participating in the exam?", "A": "Participation in the exam is typically free of charge, as it is organized by the Ministry of Higher Education."},
  {"Q": "What resources are recommended for preparing for the exam?", "A": "Recommended resources include high school textbooks, preparatory guides, online practice exams, and coaching sessions."},
  {"Q": "What is the selection criteria for admission through the exam?", "A": "Selection is based on the total score obtained in the competition, combined with the baccalaureate average and program-specific requirements."},
  {"Q": "How can I check the results of the exam?", "A": "Results are published on the Ministry of Higher Education’s website and displayed at regional examination centers."},
  {"Q": "Are there specific quotas for regions or genders in the exam?", "A": "The exam is merit-based, but some schools may have quotas for specific regions or genders depending on national policies."},
  {"Q": "What happens if I am admitted to multiple schools through the exam?", "A": "Candidates must confirm their admission to one school by the deadline specified in the admission notice."},
  {"Q": "What is the level of difficulty of the exam?", "A": "The competition is highly competitive, requiring strong knowledge in relevant subjects and excellent problem-solving skills."},
  {"Q": "What support does ESTIN provide for successful candidates?", "A": "ESTIN offers orientation sessions, academic support, and access to resources for students admitted through the exam."},
  {"Q": "Can international students participate in the exam?", "A": "The competition is primarily for Algerian students, but international students should check with the Ministry of Higher Education for eligibility."},
  {"Q": "What is the importance of the exam for higher education in Algeria?", "A": "The exam ensures that the best and most qualified students are selected for advanced programs in higher education institutions like ESTIN."},
  {"Q": "How can I stay updated on exam announcements?", "A": "Check the Ministry of Higher Education’s website and follow official social media channels for the latest updates on the competition."},
  {"Q": "What should I bring on the day of the exam?", "A": "Bring your registration confirmation, identity card, necessary writing tools, and any items specified in the exam instructions."},
  {"Q": "What is the policy on student absences at ESTIN?", "A": "Students are required to attend all scheduled classes, and absences must be justified to avoid penalties."},
  {"Q": "How can I justify an absence at ESTIN?", "A": "Absences can be justified by providing official documentation, such as a medical certificate or an official letter, to the Pedagogy Department or the course instructor."},
  {"Q": "What happens if I have an unjustified absence?", "A": "Unjustified absences may result in warnings, reduced grades for continuous assessment, or even disqualification from exams."},
  {"Q": "How many absences are allowed before penalties apply?", "A": "The allowed number of absences varies by course, but exceeding the limit without justification can lead to consequences such as exclusion from exams."},
  {"Q": "What is the procedure for reporting an absence?", "A": "Students must notify their instructor or the Pedagogy Department as soon as possible and submit supporting documents within the prescribed timeframe."},
  {"Q": "Can I make up for classes missed due to an absence?", "A": "Make-up sessions may be arranged for justified absences, depending on the instructor's discretion and course requirements."},
  {"Q": "What should I do if I miss an exam due to an absence?", "A": "If the absence is justified, you can apply for a make-up exam by submitting official documentation to the Pedagogy Department."},
  {"Q": "Who should I contact for questions about absences?", "A": "For general absence policies, contact the Pedagogy Department. For specific course-related absences, consult the course instructor."},
  {"Q": "Are absences due to medical reasons automatically accepted?", "A": "Medical absences must be accompanied by a valid medical certificate and submitted within the deadline set by the administration."},
  {"Q": "What is the deadline for submitting absence justifications?", "A": "Absence justifications must be submitted within 48 hours of returning to school, or as specified by the administration."},
  {"Q": "What happens if I have frequent absences due to chronic illness?", "A": "Students with chronic illnesses are advised to submit a medical report to the administration for consideration of special accommodations."},
  {"Q": "Can absences affect my eligibility to take final exams?", "A": "Yes, excessive unjustified absences may disqualify you from taking final exams for the affected courses."},
  {"Q": "How are group absences reported?", "A": "Group absences must be reported by a representative to the Pedagogy Department, along with an explanation for the absence."},
  {"Q": "What is the policy for absences during practical lab sessions?", "A": "Unjustified absences from lab sessions may result in a zero for that session and impact the final grade for the practical component."},
  {"Q": "Can absences due to family emergencies be excused?", "A": "Yes, family emergencies may be considered justified if accompanied by appropriate documentation, such as an official letter or evidence of the emergency."},
  {"Q": "What should I do if I anticipate a long-term absence?", "A": "Inform the Pedagogy Department in advance and provide supporting documents, such as a medical report or an official letter, to request accommodations or leave."},
  {"Q": "Are absences monitored at ESTIN?", "A": "Yes, attendance is monitored for all courses, and records are maintained by the instructors and the administration."},
  {"Q": "Can attendance influence my final grade?", "A": "Yes, attendance is often part of continuous assessment and can influence your final grade in some courses."},
  {"Q": "What is the process for appealing penalties due to absences?", "A": "Submit a written appeal to the Pedagogy Department, including any relevant justifications or supporting documents."},
  {"Q": "What is the academic calendar at ESTIN?", "A": "The academic calendar includes two main semesters, midterm exams, final exams, and a summer break. Specific dates are announced on the website."},
  {"Q": "What are the admission requirements for ESTIN?", "A": "Admission is based on baccalaureate results, with high scores in relevant fields such as mathematics and experimental sciences."},
  {"Q": "Does ESTIN offer scholarships?", "A": "Yes, scholarships are available for eligible students. Applications can be submitted through the university services portal during the registration period."},
  {"Q": "What are the available student facilities at ESTIN?", "A": "Facilities include computer labs, a library, a medical center, sports areas, and student accommodations."},
  {"Q": "How do I apply for student housing at ESTIN?", "A": "Apply for housing during the registration period through the university services portal or by contacting the accommodation office."},
  {"Q": "What is the medium of instruction at ESTIN?", "A": "The primary medium of instruction is French, with some courses available in English."},
  {"Q": "Does ESTIN have partnerships with other institutions?", "A": "Yes, ESTIN collaborates with academic and industrial partners like Huawei, Cisco, and local universities for research and training."},
  {"Q": "What are the internship requirements for ESTIN students?", "A": "Internships are mandatory for certain programs and are typically completed during the summer. Students must submit a report at the end of the internship."},
  {"Q": "What is the role of the Pedagogy Department at ESTIN?", "A": "The Pedagogy Department oversees academic activities, including scheduling, attendance, evaluations, and student support."},
  {"Q": "How can I access ESTIN’s e-learning platform?", "A": "Students can log in to the e-learning platform using their credentials provided at registration. Contact IT support for assistance if needed."},
  {"Q": "What extracurricular activities are available at ESTIN?", "A": "ESTIN offers cultural, scientific, and sports activities through various student clubs and organizations."},
  {"Q": "Are there opportunities for international exchange programs?", "A": "Yes, ESTIN participates in international exchange programs with partner universities. Details are available through the International Relations Office."},
  {"Q": "What is the process for obtaining academic certificates at ESTIN?", "A": "Certificates such as enrollment or transcript copies can be requested from the administration office or downloaded via the PROGRES platform."},
  {"Q": "Does ESTIN provide support for students with disabilities?", "A": "Yes, ESTIN offers support services for students with disabilities, including accessible facilities and tailored accommodations."},
  {"Q": "What career opportunities are available for ESTIN graduates?", "A": "ESTIN graduates find opportunities in IT, software development, data analytics, cybersecurity, and academia."},
  {"Q": "What is the dress code for students at ESTIN?", "A": "While there is no strict dress code, students are expected to dress appropriately and respectfully on campus."},
  {"Q": "How do I stay updated on announcements from ESTIN?", "A": "Updates and announcements are posted on the ESTIN website, official social media accounts, and noticeboards on campus."},
  {"Q": "What are the library services at ESTIN?", "A": "The library provides access to books, journals, digital resources, and study areas. Library hours are posted on the ESTIN website."},
  {"Q": "What is the role of student representatives at ESTIN?", "A": "Student representatives serve as a liaison between students and the administration, addressing academic and non-academic concerns."},
  {"Q": "What steps should I follow to enroll at ESTIN?", "A": "Complete the pre-registration process online, confirm your assignment, and submit required documents during final registration."},
  {"Q": "How do I report a technical issue with university platforms?", "A": "Contact the IT Department via email at ing_ouaret@estin.dz or ing_guellal@estin.dz to report and resolve technical issues."},
  {"Q": "What support does ESTIN offer for research activities?", "A": "Support includes access to research laboratories, funding opportunities, and mentorship from faculty members."},
  {"Q": "What is the mission of ESTIN?", "A": "The mission of ESTIN is to provide quality education, promote innovation, and contribute to technological advancements in Algeria."},
  {"Q": "Can I visit ESTIN before enrolling?", "A": "Yes, prospective students can visit during open days or schedule a campus tour by contacting the administration."},
  {"Q": "What conventions has ESTIN signed?", "A": "ESTIN has signed several conventions with various organizations to foster collaborations in training, academic exchanges, and digital development."},
  {"Q": "Which organizations have conventions with ESTIN?", "A": "Organizations include Huawei, the University of Béjaïa, Ooredoo, and Cisco Networking Academy."},
  {"Q": "What are the objectives of the conventions?", "A": "The conventions aim to enhance student skills, facilitate academic and industrial exchanges, and promote digital innovation."},
  {"Q": "What does the ESTIN-Huawei partnership involve?", "A": "The partnership focuses on technology training, certifications, and research in advanced digital systems."},
  {"Q": "How does the Cisco Networking Academy collaborate with ESTIN?", "A": "The collaboration offers training in networking technologies, certifications like CCNA and CCNP, and practical workshops for students."},
  {"Q": "What is the focus of the convention with Ooredoo?", "A": "The convention with Ooredoo involves joint projects in telecommunications, internships, and real-world problem-solving initiatives."},
  {"Q": "What benefits do students get from these conventions?", "A": "Students gain access to internships, training programs, certifications, and opportunities to work on industry-relevant projects."},
  {"Q": "Are there international collaborations through these conventions?", "A": "Yes, some conventions involve international institutions, providing global exposure to students and faculty."},
  {"Q": "What is the duration of these conventions?", "A": "The duration varies by agreement, but most conventions are renewed periodically based on mutual goals and achievements."},
  {"Q": "How can students participate in activities related to these conventions?", "A": "Students can participate by enrolling in training programs, applying for internships, or joining research projects facilitated through these conventions."},
  {"Q": "What are the main fields covered under these conventions?", "A": "Fields include artificial intelligence, cybersecurity, telecommunications, software development, and networking."},
  {"Q": "Are faculty members involved in these conventions?", "A": "Yes, faculty members collaborate on research, supervise student projects, and contribute to joint initiatives with partner organizations."},
  {"Q": "How do these conventions enhance research at ESTIN?", "A": "Conventions provide funding, access to advanced technologies, and collaborative opportunities for cutting-edge research."},
  {"Q": "What is the procedure for signing a new convention?", "A": "Conventions are typically signed based on shared objectives, with proposals reviewed by the administration and legal teams at ESTIN."},
  {"Q": "What role does ESTIN play in regional development through these conventions?", "A": "ESTIN contributes to regional development by collaborating on projects that address local challenges and enhance technological capacities."},
  {"Q": "Are there conventions with other universities?", "A": "Yes, ESTIN collaborates with other national and international universities for academic exchanges and research partnerships."},
  {"Q": "How do students benefit from the Huawei ICT Academy at ESTIN?", "A": "Students gain access to industry-standard training, certifications, and competitions like the Huawei ICT Competition."},
  {"Q": "What support does ESTIN provide for students involved in these conventions?", "A": "Support includes access to resources, mentorship from faculty, and guidance for internships and projects."},
  {"Q": "Where can I find more information about ESTIN's conventions?", "A": "Detailed information is available on the ESTIN website or through the administration office."},
  {"Q": "Are there conventions focused on entrepreneurship?", "A": "Yes, some conventions promote innovation and entrepreneurship through workshops, funding, and access to industry mentors."},
  {"Q": "What modules are taught in the first year at ESTIN?", "A": "First-year modules include Mathematics, Physics, Introduction to Computer Science, Algorithms, Programming, and General Culture."},
  {"Q": "What programming languages are introduced in the first year?", "A": "Students are introduced to programming languages like Python and C in their first year."},
  {"Q": "What are the second-year modules at ESTIN?", "A": "Second-year modules include Data Structures, Object-Oriented Programming, Databases, Networks, Operating Systems, and Discrete Mathematics."},
  {"Q": "What advanced topics are covered in the third year?", "A": "Third-year modules include Software Engineering, Artificial Intelligence, Advanced Databases, Web Development, and Network Security."},
  {"Q": "What are the key modules in the Artificial Intelligence specialization?", "A": "Modules include Machine Learning, Natural Language Processing, Robotics, and Deep Learning."},
  {"Q": "What modules are specific to the Cybersecurity specialization?", "A": "Modules include Cryptography, Ethical Hacking, Cyber Threat Analysis, and Security Protocols."},
  {"Q": "What topics are covered in the Data Science specialization?", "A": "Modules include Data Mining, Statistical Analysis, Big Data Technologies, and Visualization Techniques."},
  {"Q": "What modules are included in the Software Engineering track?", "A": "Modules include Software Design, Testing and Quality Assurance, Agile Methodologies, and Project Management."},
  {"Q": "What practical modules are offered at ESTIN?", "A": "Practical modules include Labs for Programming, Networking, Databases, and Operating Systems."},
  {"Q": "Are there elective modules at ESTIN?", "A": "Yes, electives include Mobile Development, Blockchain Technology, and Cloud Computing, depending on the year and specialization."},
  {"Q": "What is the focus of first-year mathematics modules?", "A": "Mathematics modules cover Linear Algebra, Calculus, and Probability Theory."},
  {"Q": "What is taught in the Networks module?", "A": "The Networks module covers Network Architectures, Protocols, and Basic Network Configuration."},
  {"Q": "How is web development taught at ESTIN?", "A": "Web Development modules include HTML, CSS, JavaScript, and backend technologies like PHP or Node.js."},
  {"Q": "What modules focus on hardware at ESTIN?", "A": "Hardware-related modules include Digital Electronics, Microcontrollers, and Embedded Systems."},
  {"Q": "What is the role of project modules in the curriculum?", "A": "Project modules allow students to apply theoretical knowledge to real-world problems, often as team projects."},
  {"Q": "Are there research-focused modules in the third cycle?", "A": "Yes, third-cycle modules include Research Methodology, Advanced Topics in AI, and Thesis Preparation."},
  {"Q": "What business-related modules are available?", "A": "Business-related modules include Entrepreneurship, Digital Marketing, and IT Project Management."},
  {"Q": "How are modules assessed at ESTIN?", "A": "Modules are assessed through a mix of exams, projects, assignments, and continuous assessment."},
  {"Q": "What interdisciplinary modules are offered?", "A": "Interdisciplinary modules include Ethics in Technology, Communication Skills, and General Culture."},
  {"Q": "Are practical labs mandatory for all students?", "A": "Yes, practical labs are mandatory and form a significant part of the curriculum to ensure hands-on learning."},
  {"Q": "What is the content of Operating Systems modules?", "A": "Operating Systems modules include Process Management, Memory Management, File Systems, and Basic OS Development."},
  {"Q": "What is covered in the Algorithms module?", "A": "The Algorithms module focuses on Sorting, Searching, Graph Algorithms, and Complexity Analysis."},
  {"Q": "Are there group projects in the modules?", "A": "Yes, group projects are included in many modules to encourage teamwork and collaborative problem-solving."},
  {"Q": "What final-year modules are required for graduation?", "A": "Final-year modules typically include Advanced Topics in the chosen specialization, a Capstone Project, and Internship."},
  {"Q": "What is the focus of the Physics module in the first year?", "A": "The Physics module covers Mechanics, Thermodynamics, and Electromagnetism to build foundational knowledge."},
  {"Q": "What modules are included in the second-year Mathematics curriculum?", "A": "Second-year Mathematics includes Differential Equations, Numerical Methods, and Linear Algebra II."},
  {"Q": "What are the advanced programming topics covered in the second year?", "A": "Advanced programming topics include Object-Oriented Programming (Java or C++), Data Structures, and Algorithms."},
  {"Q": "What is covered in the Databases module?", "A": "The Databases module teaches SQL, ER Diagrams, Normalization, and Database Management Systems (DBMS)."},
  {"Q": "What is taught in the Discrete Mathematics module?", "A": "Discrete Mathematics includes Logic, Set Theory, Graph Theory, and Combinatorics."},
  {"Q": "What topics are covered in Software Engineering modules?", "A": "Software Engineering modules include Requirement Analysis, UML Modeling, Agile Development, and Software Testing."},
  {"Q": "What are the core topics in the Artificial Intelligence module?", "A": "Core topics include Machine Learning Algorithms, Neural Networks, AI Ethics, and Reinforcement Learning."},
  {"Q": "What topics are included in the Networks module in the third year?", "A": "Advanced Networks topics include Routing Protocols, Network Security, and Wireless Communications."},
  {"Q": "What is the focus of the Cybersecurity module?", "A": "The Cybersecurity module focuses on Cyber Risk Management, Malware Analysis, Secure Coding, and Penetration Testing."},
  {"Q": "What are the modules related to Data Analytics?", "A": "Data Analytics modules include Statistical Analysis, Predictive Modeling, Data Visualization, and Big Data Tools."},
  {"Q": "What is taught in the Operating Systems Practical Lab?", "A": "Practical labs include File System Implementation, Process Scheduling Simulations, and Basic Kernel Programming."},
  {"Q": "What mobile development topics are taught in electives?", "A": "Mobile Development electives include Android App Development, UI/UX Design, and Cross-Platform Frameworks like Flutter."},
  {"Q": "What do students learn in the Blockchain Technology module?", "A": "Blockchain modules cover Distributed Ledgers, Cryptocurrencies, Smart Contracts, and Decentralized Applications (DApps)."},
  {"Q": "What is covered in Embedded Systems modules?", "A": "Embedded Systems modules include Microcontroller Programming, Sensor Integration, and Real-Time Operating Systems."},
  {"Q": "Are there modules on Machine Learning?", "A": "Yes, Machine Learning modules cover Supervised Learning, Unsupervised Learning, and Deep Learning Techniques."},
  {"Q": "What is included in the General Culture module?", "A": "General Culture includes History, Technology Impact on Society, and Professional Ethics."},
  {"Q": "What is the purpose of the Capstone Project module?", "A": "The Capstone Project allows students to apply their learning to solve real-world problems, often in collaboration with industry partners."},
  {"Q": "What is taught in the Digital Electronics module?", "A": "Digital Electronics covers Logic Gates, Circuit Design, Flip-Flops, and Memory Architectures."},
  {"Q": "What topics are covered in the Web Development Practical Lab?", "A": "Labs include Frontend Development with HTML/CSS, JavaScript, and Backend Frameworks like Node.js or PHP."},
  {"Q": "What advanced modules are offered in the final year?", "A": "Final-year advanced modules include Advanced AI Techniques, Secure Cloud Computing, and IoT Systems Design."},
  {"Q": "Are there modules on Entrepreneurship?", "A": "Yes, Entrepreneurship modules include Business Plan Development, Startup Ecosystems, and Venture Financing."},
  {"Q": "What is taught in the Communication Skills module?", "A": "The module focuses on Professional Writing, Presentation Skills, and Interpersonal Communication."},
  {"Q": "What modules focus on Cloud Computing?", "A": "Cloud Computing modules include Virtualization, Cloud Architecture, and Services like AWS and Azure."},
  {"Q": "What are the hands-on components in Networking modules?", "A": "Networking labs include Router Configuration, LAN Setup, and Network Troubleshooting Exercises."},
  {"Q": "What IoT-related topics are covered?", "A": "IoT modules include Sensor Networks, IoT Protocols, Edge Computing, and Smart Device Integration."},
  {"Q": "What are the Digital Marketing topics in electives?", "A": "Digital Marketing includes SEO, Social Media Marketing, Email Campaigns, and Analytics Tools."},
  {"Q": "What modules support interdisciplinary learning?", "A": "Modules like Ethics in AI, Green Technology, and Smart Cities encourage interdisciplinary learning."},
  {"Q": "Are there research-focused modules for final-year students?", "A": "Yes, Research Methodology and Advanced Topics in chosen specializations prepare students for academic research."},
  {"Q": "What is the ESTIN incubator?", "A": "The ESTIN incubator is a platform that supports students and alumni in developing innovative ideas into successful startups."},
  {"Q": "Who can apply to the ESTIN incubator?", "A": "The incubator is open to ESTIN students, alumni, and faculty members with innovative business or technology ideas."},
  {"Q": "What services does the ESTIN incubator provide?", "A": "Services include mentorship, workspace, networking opportunities, funding assistance, and access to industry experts."},
  {"Q": "How can I apply to the ESTIN incubator?", "A": "Applications can be submitted online through the ESTIN incubator portal or by contacting the incubation office on campus."},
  {"Q": "What types of projects does the ESTIN incubator support?", "A": "The incubator supports projects in fields like software development, artificial intelligence, IoT, cybersecurity, and digital innovation."},
  {"Q": "Does the incubator provide funding for startups?", "A": "Yes, the incubator helps startups secure funding through grants, competitions, and connections with investors."},
  {"Q": "Are there workshops and training sessions at the incubator?", "A": "Yes, the incubator regularly organizes workshops, training sessions, and boot camps on entrepreneurship and business development."},
  {"Q": "What is the duration of the incubation program?", "A": "The incubation program typically lasts 6 to 12 months, depending on the project's needs and progress."},
  {"Q": "Can external startups collaborate with the ESTIN incubator?", "A": "Yes, external startups can collaborate through partnerships or specific programs offered by the incubator."},
  {"Q": "What is the role of mentors in the incubator?", "A": "Mentors guide startups through technical, business, and market challenges, helping them achieve their goals."},
  {"Q": "Does the incubator offer networking opportunities?", "A": "Yes, the incubator connects startups with industry experts, investors, and other entrepreneurs through events and meetups."},
  {"Q": "What is the selection process for the incubation program?", "A": "The selection process involves submitting a proposal, presenting the idea to a panel, and undergoing evaluation based on innovation and feasibility."},
  {"Q": "What are the eligibility criteria for the incubation program?", "A": "Applicants must have a viable business idea with a clear plan and potential for scalability. Being an ESTIN student or alumni is often required."},
  {"Q": "Does the incubator offer support for patent registration?", "A": "Yes, the incubator provides guidance and assistance in registering patents for innovative ideas and technologies."},
  {"Q": "Are there partnerships between the ESTIN incubator and external organizations?", "A": "Yes, the incubator collaborates with industry leaders, government agencies, and academic institutions to enhance its offerings."},
  {"Q": "What kind of workspace does the incubator provide?", "A": "The incubator offers co-working spaces, meeting rooms, and access to advanced technical resources like labs and equipment."},
  {"Q": "Are there competitions hosted by the incubator?", "A": "Yes, the incubator hosts pitch competitions and innovation challenges to encourage creativity and reward promising ideas."},
  {"Q": "Can I join the incubator if I don’t have a team?", "A": "Yes, individual applicants can join the incubator. The program may help connect them with potential team members."},
  {"Q": "Does the incubator support social impact projects?", "A": "Yes, the incubator supports projects that address social challenges and contribute to sustainable development."},
  {"Q": "How does the incubator measure the success of startups?", "A": "Success is measured based on metrics like product development, market entry, revenue generation, and team growth."},
  {"Q": "Are international collaborations possible through the incubator?", "A": "Yes, the incubator fosters international collaborations through partnerships and exchange programs."},
  {"Q": "What is the role of the incubation manager?", "A": "The incubation manager oversees the program, supports startups, and facilitates connections with mentors and investors."},
  {"Q": "How does the incubator help startups with market entry?", "A": "The incubator provides market analysis, customer insights, and go-to-market strategies to help startups launch successfully."},
  {"Q": "Can startups remain in the incubator after the program ends?", "A": "Startups may be eligible for extended support based on their progress and mutual agreement with the incubator."},
  {"Q": "What are the training options in statistics?", "A": "The training includes courses on statistics with R, as well as techniques for implementing HACCP in the agri-food industry."},
  {"Q": "How can I enroll in the training programs?", "A": "Enrollment for training programs can be done through ESTIN's website or by contacting the admissions office."},
  {"Q": "Are there training programs in personal development and communication?", "A": "Yes, there are training programs in personal communication in business, communication strategy, and commercial negotiation."},
  {"Q": "What is the affiliation of ESTIN's researchers and doctoral students?", "A": "The affiliation is: LITAN Laboratory, Higher School of Computer Science and Digital Technologies (ESTIN), RN 75, Amizour 06300, Bejaia, Algeria."},
  {"Q": "What are the consequences of publishing without correct affiliation?", "A": "Any scientific publication accepted after 10/8/2022 without including the exact wording of this affiliation will not be considered for thesis defenses or habilitation applications."},
  {"Q": "What is the Doctoral Guide?", "A": "The Doctoral Guide summarizes the regulations governing the LMD doctoral training, applicable to students enrolled starting from the 2021-2022 academic year."},
  {"Q": "What is the duration of doctoral training?", "A": "Doctoral training is set at three (03) consecutive years, with the possibility of an extension of one (01) to two (02) years upon request."},
  {"Q": "What is the role of the Doctoral Training Committee (CFD)?", "A": "The CFD defines the training for doctoral students, monitors their progress, and provides input on the composition of the thesis defense jury."},
  {"Q": "What is a doctoral student logbook?", "A": "The doctoral logbook, given during enrollment, tracks the student's training and includes information on completed courses, publications, and evaluation results."},
  {"Q": "Can a thesis be prepared under co-supervision?", "A": "Yes, co-supervised theses allow a doctoral student to work under the supervision of two advisors, one in Algeria and one abroad."},
  {"Q": "What are the conditions for defending a thesis?", "A": "Defending a thesis requires a favorable report from the thesis advisor, earning at least 180 points, and meeting the evaluation criteria established by the National Scientific Commission."},
  {"Q": "How are points allocated for thesis defense?", "A": "The 180 points are distributed as follows: the thesis (100 points), training (30 points), and scientific work (a minimum of 50 points)."},
  {"Q": "What are the penalties for plagiarism?", "A": "Plagiarism can result in the cancellation of the defense, revocation of the title, and other sanctions as prescribed by applicable legislation."},
  {"Q": "What rules govern doctoral training?", "A": "The training is governed by various regulatory texts, including Decree 10-231 of October 2, 2010, and Order No. 28 of January 9, 2022."},
  {"Q": "What are the evaluation criteria for scientific journals?", "A": "Journals are classified into categories (A, B, etc.) by the National Scientific Commission, and only certain publications are accepted for the defense."},
  {"Q": "Where can I find news about ESTIN?", "A": "For news, visit https://estin.dz/category/actualites/."},
  {"Q": "Email of HARFOUCHE Lynda", "A": "Contact at: harfouche@estin.dz"},
  {"Q": "For any mailbox issues (account, password)?", "A": "Send a message to scolarite@estin.dz."},
  {"Q": "For any talent or elearn problems?", "A": "Send a message to ing_ouaret@estin.dz and ing_guellal@estin.dz."},
  {"Q": "How to contact one of my course or TD teachers?", "A": "Contact them via email at https://estin.dz/annuaire-des-enseignants/."},
  {"Q": "How to contact the director of ESTIN?", "A": "Contact their assistant via email to schedule an appointment: adg@estin.dz."},
  {"Q": "For anything regarding student scholarships and accommodation?", "A": "Contact the DOUB of Elkseur (http://doub-elkseur.dz/), located at Berchiche 3 residence and Amizour 2 residence."},
  {"Q": "For health problems?", "A": "Approach the ESTIN medical center or contact the doctor via email: medecin@estin.dz."},
  {"Q": "For medical justifications?", "A": "Approach the secretariat of the CP and CS departments or send them by email (Office #4)."},
  {"Q": "How to apply for academic leave?", "A": "Submit a dossier before exams for consideration (Office #2 and Office #3)."},
  {"Q": "For anything regarding teacher substitutes (Documents to be submitted, individual schedules)?", "A": "Approach the secretariat of the CP and CS departments (Office #4)."},
  {"Q": "Obtain the ATS and Teacher function certificates?", "A": "Contact the personnel service: sdpersonnel@estin.dz."},
  {"Q": "Obtain lists of groups, markers, brushes?", "A": "Approach the secretariat of the CP and CS departments (Office #4)."},
  {"Q": "Fill out a deficiency report (collective absence of students)?", "A": "Approach the secretariat of the CP and CS departments (Office #4)."},
  {"Q": "For documentation?", "A": "Approach the school library: bibliothèque@estin.dz."},
  {"Q": "Regarding the LMD doctorate?", "A": "Approach the secretariat of the deputy director in charge of doctoral training, scientific research, technological development, innovation, and entrepreneurship promotion (Office #12)."},
  {"Q": "Regarding external relations?", "A": "Approach the secretariat of the deputy director in charge of information systems, communication, and external relations (Office #12)."},
  {"Q": "Regarding school clubs?", "A": "Contact the cultural activities service: activites_culturelles@estin.dz."},
  {"Q": "Regarding security?", "A": "Contact Mr. AOUGHLIS Nabil: surete@estin.dz."},
  {"Q": "ESTIN address?", "A": "MW77+F23, N75, Amizour. GPS: https://maps.app.goo.gl/1YuyXPKLZEhNxt4f7."},
  {"Q": "Email of AGGAOUA Meriem", "A": "Contact at: aggaoua@estin.dz."},
  {"Q": "Email of AIT TALEB Samiha", "A": "Contact at: aittaleb@estin.dz."},
  {"Q": "Email of ALKAMA Lynda", "A": "Contact at: Alkama@estin.dz."},
  {"Q": "Email of AZOUAOU Faical", "A": "Contact at: azouaou@estin.dz."},
  {"Q": "Email of AZZOUGUER Dalila", "A": "Contact at: daliladali2403@gmail.com."},
  {"Q": "What is ESTIN REPOSITORY?", "A": "ESTIN REPOSITORY is a collection of exam topics, course materials, and resources for ESTIN students, created to support all computer science learners."},
  {"Q": "What types of documents are available on ESTIN REPOSITORY?", "A": "You can find exam topics, course materials, and academic resources for different years, including 1CP, 2CP, and 1CS."},
  {"Q": "How can I access documents on ESTIN REPOSITORY?", "A": "Documents are organized by semester and year. Navigate the website and click on the relevant links to access the resources."},
  {"Q": "Can I contribute to ESTIN REPOSITORY?", "A": "Yes, you can contribute by sharing your documents or helping to enrich the existing collection."},
  {"Q": "Who created ESTIN REPOSITORY?", "A": "The site was created by Ouassim Hamdani to assist computer science students."},
  {"Q": "How can I contact the administrator of ESTIN REPOSITORY?", "A": "You can contact the administrator via the email address provided on the site."},
  {"Q": "Is ESTIN REPOSITORY officially affiliated with ESTIN?", "A": "While the site provides resources related to ESTIN, it is independently created to help students."},
  {"Q": "Are documents on ESTIN REPOSITORY updated regularly?", "A": "The update frequency depends on contributions and the availability of new resources."},
  {"Q": "Can I use the documents on ESTIN REPOSITORY for personal studies?", "A": "Yes, the documents are provided for academic and personal use to support learning."},
  {"Q": "Is there a fee to access documents on ESTIN REPOSITORY?", "A": "Access to the documents is free for all students."},
  {"Q": "How can I report an error or issue on the site?", "A": "You can contact the administrator via the email provided to report any errors or technical issues."},
  {"Q": "Does ESTIN REPOSITORY offer resources for all ESTIN specializations?", "A": "The site mainly covers specializations in artificial intelligence, IoT, cybersecurity, and information systems."},
  {"Q": "Are the documents available in multiple languages?", "A": "Most documents are in French, in line with the primary language of instruction at ESTIN."},
  {"Q": "Can I request specific documents not yet on the site?", "A": "You can contact the administrator to express your needs, but availability depends on contributions and resources."},
  {"Q": "How can I stay updated about new resources added to ESTIN REPOSITORY?", "A": "Check the site regularly for the latest updates and document additions."},
  {"Q": "Are the documents on ESTIN REPOSITORY aligned with ESTIN’s official curriculum?", "A": "The documents reflect ESTIN’s programs but should be cross-verified with official sources for accuracy."},
  {"Q": "Can I share ESTIN REPOSITORY documents with others?", "A": "Yes, sharing knowledge is encouraged, as long as it respects copyright laws and fair use principles."},
  {"Q": "How can I financially support the maintenance of ESTIN REPOSITORY?", "A": "For financial contributions or support, contact the administrator via the email provided on the site."},
  {"Q": "Does ESTIN REPOSITORY offer forums or discussion spaces for students?", "A": "The site focuses primarily on providing documents. For discussions, students should use other platforms dedicated to ESTIN learners."},
  {"Q": "Can alumni access and contribute to ESTIN REPOSITORY?", "A": "Yes, alumni are encouraged to access and contribute to enrich the repository."},
  {"Q": "Does ESTIN REPOSITORY provide resources for internships?", "A": "No, the repository primarily focuses on academic resources such as courses, exams, and lecture notes. For internship-related materials, contact the administration."},
  {"Q": "Are there video tutorials available on ESTIN REPOSITORY?", "A": "Currently, ESTIN REPOSITORY mainly provides written documents such as PDFs and course notes. Video tutorials may not be available."},
  {"Q": "Can I download documents from ESTIN REPOSITORY?", "A": "Yes, documents on ESTIN REPOSITORY are available for download for personal and academic use."},
  {"Q": "Are there any restrictions on how I use the materials from ESTIN REPOSITORY?", "A": "Materials are intended for academic purposes. Redistribution for commercial use is not permitted without permission."},
  {"Q": "Is there a limit to how many documents I can access from ESTIN REPOSITORY?", "A": "No, there are no limits. Students can access as many documents as they need for their studies."},
  {"Q": "Does ESTIN REPOSITORY offer solutions to exam questions?", "A": "Some documents may include solved examples, but not all exam questions come with solutions."},
  {"Q": "Can teachers contribute their course materials to ESTIN REPOSITORY?", "A": "Yes, teachers are welcome to contribute their course notes and materials to enhance the repository."},
  {"Q": "Does ESTIN REPOSITORY provide documents for postgraduate programs?", "A": "The repository mainly focuses on undergraduate programs, but contributions for postgraduate courses are also accepted."},
  {"Q": "How often is the repository updated with new materials?", "A": "Updates depend on user contributions and the administrator’s availability to upload new materials."},
  {"Q": "Can I access ESTIN REPOSITORY from outside the university network?", "A": "Yes, ESTIN REPOSITORY is accessible online and can be accessed from anywhere with an internet connection."},
  {"Q": "What is the quality assurance process for materials on ESTIN REPOSITORY?", "A": "The materials are collected from students and teachers, but users are encouraged to cross-check with official ESTIN resources."},
  {"Q": "Does the repository provide research papers?", "A": "Currently, the repository focuses on academic course materials and exams. For research papers, students should consult ESTIN's research repository or digital library."},
  {"Q": "Are there guides for using ESTIN REPOSITORY effectively?", "A": "No specific guides are provided, but the site is user-friendly and easy to navigate for accessing documents."},
  {"Q": "What formats are the documents on ESTIN REPOSITORY available in?", "A": "Most documents are available in PDF format, making them accessible across devices."},
  {"Q": "Does ESTIN REPOSITORY require an account for access?", "A": "No, the repository does not require an account. It is open to all users, including ESTIN students and alumni."},
  {"Q": "Are materials categorized by difficulty level?", "A": "Materials are categorized by year and semester but not explicitly by difficulty level."},
  {"Q": "Does ESTIN REPOSITORY have a mobile application?", "A": "No, there is no mobile app available. However, the repository is accessible through mobile browsers."},
  {"Q": "Can I report outdated materials on ESTIN REPOSITORY?", "A": "Yes, you can contact the administrator to report outdated or irrelevant materials so they can be updated or removed."},
  {"Q": "Does ESTIN REPOSITORY support collaborative learning?", "A": "While it provides resources for individual study, the repository itself does not have collaborative tools like forums or group discussions."},
  {"Q": "Are there any prerequisites for using ESTIN REPOSITORY?", "A": "No, the repository is designed to be accessible and user-friendly for all ESTIN students and alumni."},
  {"Q": "Can I suggest additional features for ESTIN REPOSITORY?", "A": "Yes, suggestions for improving the repository can be sent to the administrator via email."},
  {"Q": "Does ESTIN REPOSITORY include materials for elective courses?", "A": "Yes, some elective course materials may be available, depending on user contributions."},
  {"Q": "What is the primary goal of ESTIN REPOSITORY?", "A": "The goal is to centralize academic resources and make them easily accessible to ESTIN students and alumni."},
  {"Q": "How secure is the ESTIN REPOSITORY website?", "A": "The site is hosted securely, but users are encouraged to ensure their own device security while accessing the repository."},
  {"Q": "What is the total duration of the ESTIN program?", "A": "The ESTIN program lasts five years, including two years of Integrated Preparatory Classes (CPI) and three years of advanced studies."},
  {"Q": "What are the Integrated Preparatory Classes (CPI)?", "A": "The CPI is a two-year program designed to provide students with a strong foundation in mathematics and computer science, essential for advanced studies in digital sciences and technologies."},
  {"Q": "What are the objectives of the advanced cycle at ESTIN?", "A": "The advanced cycle aims to deepen knowledge in computer science and digital technologies, with specializations in artificial intelligence, cybersecurity, Internet of Things, and information systems."},
  {"Q": "What are the requirements to enter the advanced cycle after CPI?", "A": "Students who complete the two years of CPI must pass a competitive exam to access the third year. Admission is also open to top-performing bachelor's students in computer science from universities."},
  {"Q": "What specializations are offered in the advanced cycle at ESTIN?", "A": "ESTIN offers specializations in Artificial Intelligence and Data Science, Cybersecurity, Internet of Things, and Information Systems."},
  {"Q": "What are the career opportunities after graduating from ESTIN?", "A": "ESTIN graduates can pursue careers in IT fields such as AI engineering, cybersecurity expertise, IoT development, data analysis, and more."},
  {"Q": "Does ESTIN offer continuing education programs?", "A": "Yes, ESTIN provides continuing education programs in various fields, including computer science, economics/management, and marketing, to meet professional development needs."},
  {"Q": "What are the admission criteria for new baccalaureate holders at ESTIN?", "A": "Admission criteria include a weighted average of Mathematics and Physics scores. For Priority 01, this average must be 14/20 or higher."},
  {"Q": "Does ESTIN organize open house events?", "A": "Yes, ESTIN regularly organizes open house events to inform prospective students about training programs, admission requirements, and school facilities."},
  {"Q": "What services are offered to students on the ESTIN campus?", "A": "The ESTIN campus provides various services, including a library, well-equipped laboratories, coworking spaces, and cultural and sports activities."},
  {"Q": "What languages are courses taught in at ESTIN?", "A": "Courses at ESTIN are primarily taught in French, with some programs or modules offered in English."},
  {"Q": "Does ESTIN offer internship opportunities?", "A": "Yes, internships are mandatory and integrated into the curriculum, allowing students to gain practical experience in industries related to their field of study."},
  {"Q": "Are there student exchange programs at ESTIN?", "A": "Yes, ESTIN collaborates with national and international institutions to offer student exchange programs and joint research opportunities."},
  {"Q": "What are the key subjects taught during the CPI?", "A": "Key subjects include Mathematics, Physics, Computer Science, Algorithms, Programming, and General Culture."},
  {"Q": "How are students evaluated during the CPI?", "A": "Evaluation is based on continuous assessments, exams, projects, and participation throughout the semesters."},
  {"Q": "What are the eligibility criteria for international students at ESTIN?", "A": "International students must meet equivalent academic qualifications and follow the admission procedures outlined by the Ministry of Higher Education."},
  {"Q": "Does ESTIN provide scholarships for students?", "A": "Yes, scholarships are available for eligible students based on merit or financial need. Details can be obtained from the administration."},
  {"Q": "What is the role of research in ESTIN's programs?", "A": "Research is a key component, especially in the advanced cycle, with students encouraged to participate in projects and contribute to innovation in fields like AI, IoT, and cybersecurity."},
  {"Q": "What facilities are available in ESTIN’s laboratories?", "A": "ESTIN’s labs are equipped with state-of-the-art technology for software development, data science, cybersecurity, and IoT experiments."},
  {"Q": "Are there electives in the ESTIN curriculum?", "A": "Yes, students can choose from a range of elective courses in areas like Blockchain, Cloud Computing, and Advanced AI, depending on their specialization."},
  {"Q": "What is the structure of the final year at ESTIN?", "A": "The final year includes advanced specialization modules, a capstone project, and an internship to prepare students for professional or academic careers."},
  {"Q": "Does ESTIN support students in launching startups?", "A": "Yes, through its incubator, ESTIN supports students in transforming innovative ideas into startups by providing mentorship, workspace, and networking opportunities."},
  {"Q": "What are the objectives of the Artificial Intelligence specialization?", "A": "The AI specialization focuses on machine learning, deep learning, natural language processing, and robotics applications."},
  {"Q": "What does the Cybersecurity specialization cover?", "A": "It covers topics like cryptography, network security, ethical hacking, and secure software development."},
  {"Q": "What opportunities does the Internet of Things (IoT) specialization offer?", "A": "The IoT specialization trains students to design and manage smart systems, integrating sensors, networks, and data processing technologies."},
  {"Q": "What is the Information Systems specialization focused on?", "A": "This specialization focuses on managing large-scale information systems, database management, and enterprise solutions."},
  {"Q": "Are there opportunities for doctoral studies after ESTIN?", "A": "Yes, ESTIN graduates can pursue doctoral studies in specialized fields like AI, cybersecurity, and digital systems, often supported by research projects."},
  {"Q": "Does ESTIN organize extracurricular activities?", "A": "Yes, ESTIN offers a variety of extracurricular activities, including cultural events, sports competitions, and technical workshops."},
  {"Q": "What partnerships does ESTIN have with industries?", "A": "ESTIN collaborates with companies like Huawei, Cisco, and Ooredoo to provide training, internships, and research opportunities for students."},
  {"Q": "What is the admission process for the advanced cycle at ESTIN?", "A": "Admission to the advanced cycle requires successful completion of the CPI and passing a competitive exam. Top-performing bachelor’s degree students may also apply."},
  {"Q": "Are there research opportunities for undergraduate students?", "A": "Yes, undergraduate students can participate in research projects under faculty supervision or through the school’s laboratories and innovation hubs."},
  {"Q": "What type of support does ESTIN provide for students during their studies?", "A": "ESTIN provides academic advising, mentorship, library access, and career counseling to support students throughout their studies."},
  {"Q": "How does ESTIN prepare students for the job market?", "A": "ESTIN emphasizes practical skills through internships, capstone projects, and industry-relevant training to ensure students are career-ready."}]